<!DOCTYPE html><html class="h-100">

<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
  <link href="../../../static/css/base.css" rel="stylesheet">
  <script src="https://cdn.tailwindcss.com"></script>
  <link href="https://fonts.font.im/css?family=Source+Serif+Pro%7CLato%7CInconsolata" rel="stylesheet" type="text/css">
  <link rel="shortcut icon" href="../../../static/img/favicon.png" type="image/x-icon">

  <style>
    .font-sans {
      font-family: 'Lato', 'SimHei', 'STHeiti', 'SimHei', 'Serif';
    }
    .font-serif {
      font-family: 'Source Serif Pro', 'Songti SC', 'SimSun', 'Serif', serif;
    }
  </style>
  <link rel="stylesheet" href="../../../static/katex/katex.min.css">
  <script defer src="../../../static/katex/katex.min.js"></script>
  <script defer src="../../../static/katex/auto-render.min.js" integrity="sha384-+VBxd3r6XgURycqtZ117nYw44OOcIax56Z4dCRWbxyPt0Koah1uHoK0o4+/RRE05" crossorigin="anonymous"></script>
  <script>
      document.addEventListener("DOMContentLoaded", function() {
          renderMathInElement(document.body, {
            // customised options
            // &#8226; auto-render specific keys, e.g.:
            delimiters: [
                {left: '$$', right: '$$', display: true},
                {left: '$', right: '$', display: false},
                {left: '\\(', right: '\\)', display: false},
                {left: '\\[', right: '\\]', display: true}
            ],
            // &#8226; rendering keys, e.g.:
            throwOnError : false
          });
      });
  </script>


  

<style>
.article {
  -webkit-hyphens: auto;
}
form {
  margin-block-end: 0;
}
img {
  display: inline-block;
}
code { font-size: 85%; }
pre {
  font-size: 95%;
  line-height: 120%;
}
blockquote {
  font-size: 95%;
}
p {
  font-size: 105%;
  text-indent: 2em;
}
li {
  font-size: 105%;
}
blockquote p {
  text-indent: 0em;
}
.float-right {
  padding-left: 10px;
}
.float-left {
  padding-right: 10px;
}
a {
  color: rgb(29 78 216);
}
strong {
  font-family: 'Lato', 'SimHei', 'STHeiti', 'SimHei', 'Serif';
}
.box        {
  border-radius: 2px; padding: 1px 4px 2px 4px;
  font-family: 'Lato', 'SimHei', 'STHeiti', 'SimHei', 'Serif';
  font-size: 95%;
}
.box-blue,  .badge-primary  { background-color: rgba(66, 139, 202, 0.5); color: #1d4ed8; }
.box-green, .badge-success  { background-color: rgba(92, 184, 92, 0.5);  color: #15803d; }
.box-red,   .badge-danger   { background-color: rgba(217, 83, 79, 0.5);  color: #b91c1c; }
.box-yellow,.badge-warning  { background-color: rgba(240, 173, 78, 0.5); color: #a16207; }
.box-gray   { background-color: #a0a0a0; }

.badge {
  padding: 1 4 1 4;
  display: inline-block;
  border-radius: 0.25rem;
  border: 1px solid;
}
.message p {
  text-indent: 0em;
  margin-top: 1px;
}
.message h1, h2, h3, h4, h5 {
  font-family: 'Lato', 'SimHei', 'STHeiti', 'SimHei', 'Serif';
}
.message h2 {
  font-size: 120%;
  margin-top: 5px;
  margin-bottom: 2px;
}
.message li {
  list-style: disc;
  margin-left: 2em;
}
li > p {
  text-indent: 0em;
}
block-quote h4 {
  float: left;
  display: inline-block;
}
.center {
  display: block;
  margin: auto;
}
hr {
  margin-top: 20px;
  padding-bottom: 20px;
}

.fa-gradient {
	background: -webkit-gradient(linear, left top, left bottom, from(rgb(99, 27, 103)), to(#333));
	-webkit-background-clip: text;
	-webkit-text-fill-color: transparent;
}

</style>


  <title>1-Bit &#20449;&#24687;&#30340;&#23384;&#20648;</title>
</head>

<body class="d-flex flex-column h-100">
  
  

<div>

<div class="px-2 py-1 w-full fixed z-50 bg-gradient-to-r from-black via-purple-700 via-purple-500 shadow-lg" style="-webkit-backdrop-filter: saturate(150%) blur(4px); backdrop-filter: saturate(150%) blur(4px)">
  <form>
    <a href="../../../index.html"><span class="text-lg px-2 text-white">Yanyan's Wiki</span></a>
    <a href="../../2023/index.html"><span class="text-sm px-2 text-white">&#25805;&#20316;&#31995;&#32479; (2023)</span></a>
    <input maxlength="9" id="token-input" class="float-right appearance-none border border-transparent px-2 py-1 w-20 bg-white text-gray-700 placeholder-gray-400 shadow-md rounded text-xs focus:outline-none focus:ring-2 focus:ring-purple-600 focus:border-transparent font-mono" type="text" placeholder="TOKEN" oninput="login();">
  </form>
</div>

<div class="article container mx-auto md:px-8 lg:px-8 xl:px-8 2xl:px-8 shadow-lg border pb-8 pt-10 max-w-screen-md text-justify divide-y-2 divide-white">
  <div><h1 id="1-bit" class=" text-2xl mt-2 font-sans">1-Bit &#20449;&#24687;&#30340;&#23384;&#20648;</h1>
<blockquote class=" bg-gray-200 p-2 rounded mb-2 mt-2 mx-4">
<h4 id="_1" class=" pt-2 pb-2 font-sans float-left text-sm box border mr-1 mt-1 box-blue" style=" padding-bottom: 0;">&#26412;&#35762;&#38405;&#35835;&#26448;&#26009;</h4>
<p class=" font-serif my-1"><a href="http://pages.cs.wisc.edu/~remzi/OSTEP/" class=" text-amber-900">&#25945;&#31185;&#20070; (Operating Systems: Three Easy Pieces, OSTEP)</a> &#31532; 37, 44 &#31456;&#12290;</p>
</blockquote>
<p class=" font-serif my-1">&#20026;&#20102;&#35753;&#35745;&#31639;&#26426;&#31995;&#32479;&#33021;&#22815;&#36816;&#34892;&#65292;&#31243;&#24207;&#12289;&#29992;&#25143;&#25968;&#25454;&#31561;&#37117;&#24517;&#39035;<strong>&#25345;&#20037;</strong>&#22320;&#23384;&#20648;&#19979;&#26469;&#65292;&#36825;&#23601;&#26159; Three Easy Pieces &#20013;&#30340;&#26368;&#21518;&#19968;&#37096;&#20998;: persistence&#12290;&#8220;&#25345;&#20037;&#21270;&#8221; &#37096;&#20998;&#26368;&#26089;&#23454;&#29616;&#20026; &#8220;&#25991;&#20214;&#31995;&#32479;&#8221;&#65292;&#20197;&#25991;&#20214;&#30340;&#24418;&#24335;&#32479;&#19968;&#22320;&#31649;&#29702;&#23384;&#20648;&#22120;&#19978;&#30340;&#25968;&#25454;&#65307;&#20037;&#32780;&#20037;&#20043;&#65292;&#38543;&#30528; everything is a file, &#25991;&#20214;&#31995;&#32479;&#30340; API &#20063;&#29992;&#26469;&#35775;&#38382;&#25805;&#20316;&#31995;&#32479;&#20013;&#30340;&#20247;&#22810;&#23545;&#35937;&#65292;&#22240;&#27492; &#8220;&#25345;&#20037;&#21270;&#8221; &#37096;&#20998;&#20063;&#25581;&#24320;&#20102;&#25805;&#20316;&#31995;&#32479;&#20013;&#23545;&#35937;&#30340;&#36855;&#20320;&#12290;</p>
<p class=" font-serif my-1">&#22312;&#29702;&#35299;&#25805;&#20316;&#31995;&#32479;&#22914;&#20309;&#31649;&#29702;&#25345;&#20037;&#21270;&#30340;&#23384;&#20648;&#20171;&#36136;&#20043;&#21069;&#65292;&#25105;&#20204;&#26377;&#24517;&#35201;&#39318;&#20808;&#20102;&#35299;&#19968;&#19979;&#25968;&#25454;&#26159;&#22914;&#20309;&#22312;&#29289;&#29702;&#19990;&#30028;&#20013;&#23454;&#29616;&#25345;&#20037;&#23384;&#20648;&#30340;&#12290;&#24403;&#25105;&#20204;&#35828; &#8220;&#25968;&#25454;&#8221; &#30340;&#26102;&#20505;&#65292;&#25105;&#20204;&#24182;&#19981;&#20851;&#24515;&#23427;&#30340;&#32467;&#26500;&#26159;&#20160;&#20040;&#8212;&#8212;&#25105;&#20204;&#19981;&#22952;&#23601;&#25226;&#25968;&#25454;&#30475;&#25104;&#26159;&#19968;&#20010; (0/1 bit) &#30340;&#25968;&#32452;&#12290;&#22312;&#36825;&#20010; &#8220;&#25968;&#32452;&#8221; &#30340;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#21487;&#20197;&#26500;&#36896;&#20986;&#21508;&#31181;&#21508;&#26679;&#30340;&#25968;&#25454;&#32467;&#26500; (&#23601;&#20687;&#20869;&#23384;&#21487;&#20197;&#30475;&#20316;&#26159;&#19968;&#20010;&#25968;&#32452;&#65292;&#25968;&#25454;&#32467;&#26500;&#35838;&#31243;&#23601;&#26159;&#30740;&#31350;&#22312;&#20869;&#23384;&#36825;&#26679;&#19968;&#20010;&#38543;&#26426;&#35775;&#38382;&#30340;&#23384;&#20648;&#22120;&#19978;&#26500;&#36896;&#26377;&#21508;&#31181;&#29305;&#24615;&#30340;&#25277;&#35937;&#25968;&#25454;&#31867;&#22411;)&#65292;&#26356;&#22909;&#22320;&#31649;&#29702;&#23384;&#20648;&#22120;&#8212;&#8212;&#32780;&#36825;&#24688;&#24688;&#20063;&#23601;&#26159;&#25345;&#20037;&#21270;&#37096;&#20998;&#30340;&#37325;&#35201;&#20869;&#23481;&#12290;</p>
<h2 id="1" class=" text-xl mt-2 pb-2 font-sans">1. &#30913; (&#30913;&#38081;&#25918;&#32622;&#30340;&#26041;&#21521;)</h2>
<p class=" font-serif my-1">&#20026;&#20102;&#23384;&#20648; 1-bit &#30340;&#20449;&#24687;&#65292;&#25105;&#20204;&#38656;&#35201;&#19968;&#20010;&#33021;&#22815;&#34987;&#21453;&#22797;&#32534;&#36753;&#20026;&#20004;&#31181;&#19981;&#21516; &#8220;&#29366;&#24577;&#8221; &#30340;&#29289;&#29702;&#20171;&#36136;&#12290;&#24573;&#28982;&#25105;&#20204;&#24819;&#21040;&#20102;&#29289;&#29702;&#35838;&#19978;&#30340;&#37027;&#20123;&#20869;&#23481;&#65306;&#23548;&#20307;&#22312;&#30913;&#22330;&#20013;&#20999;&#21106;&#30913;&#24863;&#32447;&#36816;&#21160;&#65292;&#20250;&#20135;&#29983;&#24863;&#24212;&#30005;&#27969;&#65307;&#24863;&#24212;&#30005;&#27969;&#30340;&#26041;&#21521;&#19982;&#30913;&#22330;&#26041;&#21521;&#30456;&#20851; (&#26974;&#27425;&#23450;&#24459;)&#12290;</p>
<p class=" font-serif my-1">&#27809;&#38169;&#65292;&#26089;&#22312; 1928 &#24180;&#65292;<a href="https://en.wikipedia.org/wiki/Magnetic_tape" class=" text-amber-900">&#30913;&#24102;</a>&#34987;&#24503;&#22269;&#24037;&#31243;&#24072; Fritz Pfleumer &#21457;&#26126;&#20986;&#26469;&#12290;</p>
<blockquote class=" bg-gray-200 p-2 rounded mb-2 mt-2 mx-4">
<h4 id="1-bit_1" class=" pt-2 pb-2 font-sans float-left text-sm box border mr-1 mt-1 box-blue" style=" padding-bottom: 0;">1-bit = &#30913;&#38081;&#25918;&#32622;&#30340;&#26041;&#21521;</h4>
<p class=" font-serif my-1">&#25226;&#19968;&#22359;&#30913;&#38081;&#22312;&#20004;&#20010;&#30456;&#21453;&#30340;&#26041;&#21521;&#25918;&#32622;&#65292;&#24182;&#19988;&#20351;&#23548;&#20307;&#20999;&#21106;&#30913;&#24863;&#32447;&#23601;&#33021;&#24471;&#21040;&#26041;&#21521;&#30456;&#21453;&#30340;&#30005;&#27969;&#8212;&#8212;&#23558;&#36825;&#20010;&#24494;&#23567;&#30340;&#20449;&#21495;&#25918;&#22823;&#23601;&#33021;&#24471;&#21040;&#19968;&#20010; 0/1 bit &#30340;&#20449;&#24687;&#12290;</p>
<p class=" font-serif my-1">&#8220;&#25226;&#30913;&#38081;&#26397;&#30528;&#26576;&#20010;&#26041;&#21521;&#25918;&#32622;&#8221; &#21448;&#24688;&#22909;&#21487;&#20197;&#29992;&#30005;&#30913;&#38081;&#23454;&#29616;&#8212;&#8212;&#22312;&#32440;&#24102;&#19978;&#31896;&#19978;&#38081;&#30913;&#20307;&#31881;&#26411;&#65292;&#21152;&#20197;&#22806;&#30913;&#22330; (&#36890;&#36807;&#30005;&#30913;&#38081;&#20135;&#29983;&#26041;&#21521;&#21487;&#25511;&#30340;&#22806;&#30913;&#22330;) &#23601;&#33021;&#23454;&#29616;&#25968;&#25454;&#30340;&#20889;&#20837;&#12290;</p>
<p class=" font-serif my-1"><img alt="" class="center" src="../../../pages/OS/img/hard-disk-mag.jpg" width="550px"></p>
</blockquote>
<p class=" font-serif my-1">&#30913;&#24102;&#30340;&#22909;&#22788;&#26159;&#21487;&#20197;&#25226;&#23494;&#24230;&#20570;&#24471;&#30456;&#24403;&#22823;&#65292;&#32780;&#19988;&#25104;&#26412;&#24456;&#20302;&#8212;&#8212;&#30913;&#24102;&#24456;&#23481;&#26131;&#20570;&#21040;&#21644;&#35835;&#20889;&#35013;&#32622; (&#30913;&#24102;&#26426;) &#20998;&#24320;&#65292;&#20294;&#32570;&#28857;&#20063;&#24456;&#26126;&#26174;&#65306;&#26080;&#27861;&#36827;&#34892;&#39640;&#25928;&#30340;&#38543;&#26426;&#35835;&#20889;&#12290;</p>
<p class=" font-serif my-1">&#20026;&#20102;&#25903;&#25345;&#38543;&#26426;&#35775;&#38382;&#65292;&#25105;&#20204;&#21487;&#20197;&#25226;&#33509;&#24178;&#30913;&#24102;&#24182;&#34892;&#65292;&#24182;&#19988;&#35753;&#30913;&#24102;&#20197;&#22266;&#23450;&#30340;&#36895;&#24230;&#32469;&#36724;&#26059;&#36716;&#12290;&#20551;&#35774;&#19968;&#20998;&#38047;&#26059;&#36716; 1200 &#27425;&#65292;&#37027;&#20040;&#35835;&#21462;&#20219;&#24847;&#25968;&#25454;&#30340;&#24310;&#36831;&#37117;&#19981;&#20250;&#36229;&#36807; 50ms&#65292;&#36825;&#23601;&#26159;&#8220;&#30913;&#40723;&#8221;&#12290;</p>
<p class=" font-serif my-1"></p><center><img alt="" src="../../../pages/OS/img/drum-memory.jpg" width="550px"></center>
<p class=" font-serif my-1">&#20026;&#20102;&#33719;&#21462;&#26356;&#20339;&#30340;&#35775;&#38382;&#24615;&#33021;&#21644;&#26356;&#22823;&#30340;&#23481;&#37327;&#65292;&#25105;&#20204;&#19981;&#38590;&#21457;&#29616;&#33267;&#23569;&#38656;&#35201;&#20570;&#21040;&#20004;&#28857;&#65306;</p>
<ul class=" list-disc font-serif">
<li class=" ml-8">&#19981;&#33021;&#20165;&#22312;&#19968;&#32500;&#30340;&#30913;&#24102;&#19978;&#23384;&#20648;&#25968;&#25454;&#65292;&#32780;&#26159;&#24212;&#24403;&#23558; bits &#32039;&#23494;&#22320;&#25490;&#24067;&#22312;&#19968;&#20010;&#20108;&#32500;&#24179;&#38754;&#19978;</li>
<li class=" ml-8">&#38656;&#35201;&#33021;&#22815;&#39640;&#25928;&#22320;&#22312;&#20108;&#32500;&#24179;&#38754;&#19978;&#21462;&#20986;&#25968;&#25454;</li>
</ul>
<p class=" font-serif my-1">&#20110;&#26159;&#19968;&#20010;&#24039;&#22937;&#30340;&#24819;&#27861;&#23601;&#26174;&#24471;&#21313;&#20998;&#33258;&#28982;&#20102;&#65306;&#25105;&#20204;&#25226;&#30913;&#24102;&#21644;&#30913;&#40723;&#25340;&#36215;&#26469;&#23601;&#34892;&#20102;&#65281;</p>
<p class=" font-serif my-1"></p><center><img alt="" src="../../../pages/OS/img/mag-disk.png" width="550px"></center>
<p class=" font-serif my-1">&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#21482;&#38656;&#35201;&#22312;&#20108;&#32500;&#24179;&#38754;&#19978;&#20197;&#21516;&#24515;&#22278;&#30340;&#26041;&#24335;&#25918;&#32622;&#24456;&#22810;&#30913;&#24102;&#65292;&#24182;&#19988;&#35774;&#35745;&#19968;&#20010;&#33021;&#22815;&#24555;&#36895;&#22312;&#19968;&#20010;&#26041;&#21521;&#19978;&#31227;&#21160;&#30340;&#26426;&#26800;&#33218;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;&#22312;&#30701;&#26102;&#38388;&#20869;&#25195;&#36807;&#20108;&#32500;&#24179;&#38754;&#19978;&#30340;&#20219;&#24847;&#19968;&#27573;&#36830;&#32493;&#30340;&#22278;&#21608;&#21306;&#22495;&#20102;&#8212;&#8212;</p>
<ul class=" list-disc font-serif">
<li class=" ml-8">&#39318;&#20808;&#65292;&#25805;&#32437;&#35835;&#20889;&#22836;&#21040;&#36798;&#25351;&#23450;&#30340;&#21516;&#24515;&#22278;&#12290;&#36825;&#20010;&#25805;&#20316;&#31216;&#20026; &#8220;&#23547;&#36947;&#8221;&#65292;&#23547;&#36947;&#26102;&#38388;&#19968;&#33324;&#22312;&#20960; ms&#12290;</li>
<li class=" ml-8">&#31561;&#24453;&#35835;&#20889;&#22836;&#21040;&#36798;&#38656;&#35201;&#35835;&#21462;&#30340;&#20301;&#32622;&#65292;&#20363;&#22914;&#23545;&#20110; 7200rpm &#30340;&#30913;&#30424;&#65292;&#33267;&#22810;&#38656;&#35201;&#31561; 8.33 ms&#65292;&#28982;&#21518;&#35835;&#20889;&#22836;&#23601;&#21487;&#20197;&#20687;&#30913;&#24102;&#19968;&#26679;&#35835;&#20986;/&#20889;&#20837;&#25968;&#25454;&#12290;</li>
</ul>
<p class=" font-serif my-1">&#20026;&#20102;&#25552;&#39640;&#30913;&#30424;&#30340;&#23481;&#37327;&#21644;&#36895;&#24230;&#65292;&#25105;&#20204;&#21487;&#20197;&#22312;&#30913;&#30424;&#19978;&#25918;&#32622;&#22810;&#20010;&#30424;&#29255; (&#27599;&#20010;&#30424;&#29255;&#20004;&#38754;&#37117;&#21487;&#20197;&#35835;&#20889;)&#65292;&#24182;&#20026;&#27599;&#20010;&#30424;&#29255;&#35774;&#32622;&#19968;&#20010;&#35835;&#20889;&#22836;&#12290;&#20851;&#20110;&#30913;&#30424;&#30340;&#26356;&#35814;&#32454;&#20171;&#32461;&#35831;&#38405;&#35835;&#25945;&#31185;&#20070;&#12290;&#30913;&#30424;&#21487;&#20197;&#20570;&#21040;&#39640;&#36895;&#12289;&#22823;&#23481;&#37327;&#12289;&#20215;&#26684;&#20415;&#23452;&#65292;&#22240;&#27492;&#19968;&#30452;&#20197;&#26469;&#37117;&#26159;&#35745;&#31639;&#26426;&#31995;&#32479;&#30340;&#20027;&#27969;&#23384;&#20648;&#12290;</p>
<p class=" font-serif my-1">&#30913;&#30424;&#23384;&#20648;&#22120;&#21463;&#21040; Flash SSD &#25104;&#26412;&#38477;&#20302;&#12289;&#36895;&#24230;&#22686;&#38271;&#30340;&#20914;&#20987;&#65292;&#36880;&#28176;&#24320;&#22987;&#36828;&#31163;&#28040;&#36153;&#24066;&#22330;&#65292;&#20170;&#22825;&#25105;&#20204;&#20080;&#21040;&#30340;&#25163;&#26426;&#21644;&#31508;&#35760;&#26412;&#30005;&#33041;&#36234;&#26469;&#36234;&#22810;&#22320;&#20351;&#29992;&#22266;&#24577;&#23384;&#20648;&#12290;</p>
<h2 id="2" class=" text-xl mt-2 pb-2 font-sans">2. &#20809; (&#25366;&#22353;/&#22635;&#22353;)</h2>
<p class=" font-serif my-1">&#22914;&#26524;&#25105;&#20204;&#24819;&#35201;&#20570;&#20986;&#39640;&#23494;&#24230;&#12289;&#21482;&#20889;&#19968;&#27425;&#12289;&#21453;&#22797;&#35835;&#21462;&#30340;&#35774;&#22791;&#65292;&#21487;&#20197;&#37319;&#29992;&#21478;&#19968;&#20010;&#26041;&#27861;&#8212;&#8212;&#25366;&#22353;&#12290;&#19982;&#30913;&#30424;&#31867;&#20284;&#65292;&#25105;&#20204;&#21487;&#20197;&#25226;&#25968;&#25454;&#19968;&#22280;&#19968;&#22280;&#22320;&#25490;&#21015;&#22312;&#20108;&#32500;&#24179;&#38754;&#19978;&#65292;&#36825;&#26679;&#21482;&#38656;&#25972;&#20010;&#30424;&#38754;&#32469;&#20013;&#28857;&#26059;&#36716;&#65292;&#21644;&#19968;&#20010;&#20855;&#26377;&#33258;&#30001;&#24230;&#30340;&#30005;&#26426;&#21363;&#21487;&#23454;&#29616;&#25968;&#25454;&#30340;&#23450;&#20301;&#12290;</p>
<blockquote class=" bg-gray-200 p-2 rounded mb-2 mt-2 mx-4">
<h4 id="1-bit_2" class=" pt-2 pb-2 font-sans float-left text-sm box border mr-1 mt-1 box-blue" style=" padding-bottom: 0;">1-bit = &#25366;&#22353;/&#22635;&#22353;</h4>
<p class=" font-serif my-1">&#20809;&#30424;&#26377;&#19968;&#20010; &#8220;&#21453;&#23556;&#23618;&#8221;&#65292;&#33021;&#22815;&#21453;&#23556;&#20809;&#32447;&#65292;&#20294;&#34987;&#19968;&#23618;&#19981;&#21453;&#23556;&#20809;&#32447;&#30340;&#23618;&#35206;&#30422;&#12290;&#22914;&#26524;&#25226;&#36825;&#19968;&#23618;&#28903;&#31359;&#65292;&#23601;&#33021;&#22312;&#28608;&#20809;&#25195;&#25551;&#36807;&#26377;&#22353;/&#27809;&#26377;&#22353;&#26102;&#35835;&#20986;&#19981;&#21516;&#30340;&#25968;&#25454;&#65292;&#22240;&#27492;&#19968;&#20010;&#22353;&#23601;&#26377;&#20102; 1-bit &#30340;&#25968;&#25454;&#12290;</p>
<p class=" font-serif my-1"><img alt="" class="center" src="../../../pages/OS/img/cdplay.gif" width="550px"></p>
</blockquote>
<p class=" font-serif my-1">&#20809;&#21644;&#30913;&#30424;&#19968;&#26679;&#38656;&#35201;&#26426;&#26800;&#37096;&#20214;&#23450;&#20301;&#21644;&#26059;&#36716;&#12290;&#28982;&#32780;&#65292;&#30828;&#30424;&#30424;&#29255;&#21644;&#35835;&#20889;&#22836;&#36890;&#24120;&#23553;&#35013;&#22312;&#30495;&#31354;&#20013;&#65292;&#21487;&#20197;&#36798;&#21040;&#36739;&#39640;&#30340;&#36716;&#36895;&#65292;&#20294;&#20809;&#30424;&#19982;&#30913;&#24102;&#31867;&#20284;&#65292;&#23384;&#20648;&#20171;&#36136;&#21644;&#35835;&#20889;&#22836;&#26159;&#20998;&#31163;&#24335;&#35774;&#35745; (&#20415;&#20110;&#31227;&#21160;)&#65292;&#22240;&#27492;&#35835;&#20889;&#36895;&#24230;&#19981;&#22914;&#30913;&#30424;&#65307;&#32780;&#19988;&#22240;&#20026;&#8220;&#25366;&#22353;&#8221;&#26159;&#19981;&#21487;&#36870;&#25805;&#20316;&#65292;&#20809;&#30424;&#36890;&#24120;&#20316;&#20026;&#21482;&#35835;&#20171;&#36136;&#12290;</p>
<p class=" font-serif my-1">&#24403;&#28982;&#24635;&#26377;&#20154;&#24819;&#20986;&#21508;&#31181;&#21508;&#26679;&#30340;&#40657;&#31185;&#25216;&#12290;&#22914;&#26524;&#25226; &#8220;&#22353;&#8221; &#25913;&#25104;&#26576;&#19968;&#31181;&#26448;&#26009;&#65292; &#23427;&#21487;&#20197; (&#36890;&#36807;&#28608;&#20809;) &#35774;&#32622;&#25104;&#20004;&#31181;&#19981;&#21516;&#30340;&#21453;&#23556;&#29575;&#65292;&#37027;&#23601;&#23454;&#29616;&#20102;&#21487;&#35835;&#20889;&#30340; CD &#20102;&#65292;&#36825;&#23601;&#26159; CD-ReWritable (CD-RW)&#12290;&#36890;&#36807; (&#26576;&#31181; JYY &#19981;&#30693;) &#30340; Phase-Change Material (PCM) &#26448;&#26009;&#21487;&#20197;&#23454;&#29616;&#36825;&#19968;&#28857;&#12290;&#30456;&#27604;&#20110;&#30828;&#30424;&#65292;&#20809;&#30424;&#22240;&#20026;&#35835;&#20889;&#37096;&#20214; (&#20809;&#39537;) &#21644;&#30424;&#29255;&#20998;&#31163;&#65292;&#22240;&#27492;&#21333;&#20010;&#30424;&#29255;&#30340;&#25104;&#26412;&#21487;&#20197;&#26356;&#20302; (&#24037;&#21378;&#36890;&#36807;&#27597;&#29255; + &#21387;&#29255;&#30340;&#26041;&#24335;&#22823;&#25209;&#37327;&#29983;&#20135;)&#65292;&#25152;&#20197;&#38750;&#24120;&#36866;&#21512;&#20316;&#20026;&#25968;&#23383;&#23186;&#20307;&#30340;&#21457;&#24067;&#20171;&#36136; (&#26080;&#25439;&#38899;&#20048;&#12289;&#30005;&#24433;&#12289;&#28216;&#25103;&#8230;&#8230;)&#12290;</p>
<p class=" font-serif my-1">&#24403;&#20320;&#24863;&#35273;&#20351;&#29992; AppStore &#19979;&#36733;&#24212;&#29992;&#12289;Steam &#19979;&#36733;&#28216;&#25103;&#26102;&#65292;&#20320;&#24050;&#32463;&#24847;&#35782;&#21040;&#39640;&#36895;&#30340;&#20114;&#32852;&#32593;&#20351; CD &#20302;&#25104;&#26412;&#12289;&#21487;&#31227;&#21160;&#30340;&#20248;&#21183;&#21464;&#24471;&#24494;&#19981;&#36275;&#36947;&#12290;&#20540;&#24471;&#24198;&#24184;&#30340;&#26159;&#65292;&#27599;&#19968;&#20010;&#25216;&#26415;&#30340;&#28120;&#27760;&#37117;&#24847;&#21619;&#30528;&#26356;&#22909;&#30340;&#25216;&#26415;&#21462;&#32780;&#20195;&#20043;&#12290;</p>
<h2 id="3" class=" text-xl mt-2 pb-2 font-sans">3. &#30005; (&#19982;&#38750;&#38376;)</h2>
<p class=" font-serif my-1">&#25105;&#20204;&#30495;&#27491;&#30340;&#20027;&#35282;&#32456;&#20110;&#30331;&#22330;&#12290;&#30913;&#30424;&#21644;&#20809;&#30424;&#32456;&#31350;&#26080;&#27861;&#25670;&#33073;&#26059;&#36716;&#30340;&#26426;&#26800;&#35013;&#32622;&#8212;&#8212;&#20026;&#20102;&#22312;&#20108;&#32500;&#24179;&#38754;&#19978;&#23450;&#20301;&#19968;&#20010;&#28857;&#65292;&#25105;&#20204;&#38656;&#35201;&#20004;&#20010;&#33258;&#30001;&#24230;&#65292;&#32780;&#30446;&#21069;&#20154;&#31867;&#33021;&#23454;&#29616;&#30340;&#20415;&#23452;&#21448;&#39640;&#36895;&#30340;&#26041;&#27861;&#65292;&#23601;&#26159;&#26059;&#36716; + &#26377;&#19968;&#20010;&#33258;&#30001;&#24230;&#30340;&#26426;&#26800;&#33218;&#8212;&#8212;&#21363;&#20415;&#22312;&#30495;&#31354;&#24773;&#20917;&#19979;&#65292;&#39640;&#36895;&#26059;&#36716;&#37096;&#20214;&#30340;&#33021;&#32791;&#12289;&#22122;&#38899;&#12289;&#26426;&#26800;&#19981;&#31283;&#23450;&#24615;&#37117;&#26159;&#30913;&#30424;&#30340;&#38382;&#39064;&#12290;</p>
<p class=" font-serif my-1">&#24402;&#26681;&#32467;&#24213;&#65292;&#20026;&#20102;&#23454;&#29616;&#24555;&#36895;&#22320;&#35775;&#38382;&#19968;&#20010; bit&#65292;&#25105;&#20204;&#36824;&#26159;&#38656;&#35201;&#20511;&#21161;&#30005;&#20449;&#21495;&#12290;&#36825;&#26102;&#20505;&#20320;&#24212;&#35813;&#24819;&#36215;&#20102; &#8220;&#25968;&#23383;&#36923;&#36753;&#30005;&#36335;&#8221; &#20013;&#30340;&#20869;&#23384; (SRAM/DRAM)&#8212;&#8212;&#34429;&#28982;&#23427;&#20204;&#26159;&#26131;&#22833; (volatile&#65292;&#21363;&#26029;&#30005;&#21518;&#25968;&#25454;&#20250;&#20002;&#22833;) &#30340;&#65292;&#20294;&#23427;&#20204;&#30340;&#36895;&#24230;&#36275;&#22815;&#24555;&#65306;</p>
<p class=" font-serif my-1"><img alt="" class="center" src="../../../pages/OS/img/dram-cells.jpg" width="300px"></p>
<p class=" font-serif my-1">&#25105;&#20204;&#21482;&#38656;&#35201;&#34892;/&#21015;&#36873;&#36890;&#30340;&#20449;&#21495;&#65292;&#23601;&#33021;&#20197;&#36817;&#20284;&#20809;&#36895;&#21462;&#20986;&#19968;&#20010; DRAM cell &#20013;&#30340;&#20540;&#8212;&#8212;&#20351;&#29992;&#30005;&#20449;&#21495;&#25165;&#26159;&#35745;&#31639;&#26426;&#31995;&#32479;&#23384;&#20648;&#35774;&#22791;&#30340;&#24212;&#26377;&#35299;&#20915;&#26041;&#26696;&#12290;&#23427;&#27809;&#26377;&#20219;&#20309;&#26426;&#26800;&#35013;&#32622;&#12289;&#21487;&#20197; 3D &#25670;&#25918;&#12289;&#33021;&#22815;&#20219;&#24847;&#36873;&#36890; (&#20174;&#32780;&#26377;&#36229;&#39640;&#30340;&#21487;&#25193;&#23637;&#24615;)&#12290;</p>
<blockquote class=" bg-gray-200 p-2 rounded mb-2 mt-2 mx-4">
<h4 id="1-bit-nand" class=" pt-2 pb-2 font-sans float-left text-sm box border mr-1 mt-1 box-blue" style=" padding-bottom: 0;">1-bit = NAND &#38376;&#24341;&#33050;&#19978;&#30340;&#20449;&#21495;</h4>
<p class=" font-serif my-1">&#8220;&#19982;&#38750;&#38376;&#8221; <code>NAND(x, y) = !(x &amp; y)</code></p>
<p class=" font-serif my-1">&#22914;&#26524;&#25105;&#20204;&#33021;&#23558;&#19968;&#20010;&#19982;&#38750;&#38376;&#30340;&#36755;&#20837;&#36827;&#34892;&#32534;&#31243;&#65292;&#23558;&#20854;&#30830;&#23450;&#20026; 0/1&#65292;&#23601;&#33021;&#23454;&#29616;&#19968;&#20010; bit &#30340;&#23384;&#20648;&#12290;&#36890;&#36807;&#32473;&#21322;&#23548;&#20307; floating gate &#20805;&#30005;/&#25918;&#28857;&#65292;&#23601;&#33021;&#22815;&#23454;&#29616;&#36825;&#19968;&#28857;&#12290;</p>
<p class=" font-serif my-1"><img alt="" class="center" src="../../../pages/OS/img/nand-flash.jpg" width="550px"></p>
</blockquote>
<p class=" font-serif my-1">&#20294;&#20026;&#20160;&#20040; Flash Memory &#22312;&#24456;&#38271;&#19968;&#27573;&#26102;&#38388; (&#29978;&#33267; U &#30424;&#37117; &#8220;&#28866;&#22823;&#34903;&#8221; &#20102;) &#37117;&#26080;&#27861;&#26367;&#20195; HDD &#21602;&#65311;&#36825;&#26159;&#22240;&#20026; NAND Flash &#26377;&#19968;&#20010;&#24456;&#20005;&#37325;&#30340;&#32570;&#38519;&#8212;&#8212;&#25830;&#38500;&#30340;&#27425;&#25968;&#26377;&#25968;&#21315;&#21040;&#19978;&#19975;&#30340;&#19978;&#38480;&#12290;&#36825;&#26159;&#22240;&#20026;&#27599;&#27425; erase &#25805;&#20316;&#26102;&#37117;&#20250;&#36827;&#34892;&#19968;&#27425;&#25918;&#30005;&#65292;&#20294;&#25918;&#30005;&#26080;&#27861;&#25918;&#21040; 100% &#24178;&#20928;&#65292;&#21040;&#19968;&#23450;&#23551;&#21629;&#20043;&#21518;&#65292;&#23601;&#22987;&#32456;&#26159;&#20805;&#30005;&#30340;&#29366;&#24577;&#12290;&#19968;&#20010;&#25968;&#25454;&#22359;&#21482;&#33021;&#20889;&#20960;&#21315;&#21040;&#20960;&#19975;&#27425;&#65292;&#36825;&#21548;&#36215;&#26469;&#26159;&#38590;&#20197;&#25509;&#21463;&#30340;&#12290;&#36825;&#26679;&#22914;&#26524;&#25105;&#20204;&#21453;&#22797;&#20889;&#19968;&#20010;&#25991;&#20214;&#20960;&#19975;&#27425; (&#25991;&#20214;&#31995;&#32479;&#30340;&#20803;&#25968;&#25454;&#20889;&#20837;&#29978;&#33267;&#39057;&#32321;&#24471;&#22810;)&#65292;&#30913;&#30424;&#19981;&#23601;&#25439;&#22351;&#20102;&#20040;&#65311;&#20960;&#19975;&#27425;&#21487;&#19981;&#26159;&#20010;&#22823;&#25968;&#30446;&#65292;&#23588;&#20854;&#26159;&#37027;&#20123;&#39057;&#32321;&#30340;&#25991;&#20214;&#31995;&#32479;&#30446;&#24405;&#25805;&#20316;&#12290;&#19981;&#36807;&#25105;&#20204;&#20080;&#30340;&#28040;&#36153;&#32423; SSD&#65292;&#21363;&#20415;&#25105;&#26159;&#37325;&#24230;&#30913;&#30424;&#20351;&#29992;&#32773;&#65292;&#20063;&#27809;&#21548;&#35828;&#36807; &#8220;&#20889;&#22351;&#8221; &#21568;&#12290;</p>
<p class=" font-serif my-1">&#20320;&#24819;&#30340;&#27809;&#38169;&#8212;&#8212;&#30828;&#20214;&#30340;&#32570;&#38519;&#65292;&#36719;&#20214;&#26469;&#34917;&#12290;SSD &#30340; FTL (flash translation layer) &#34987;&#24320;&#21457;&#20986;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#23427;&#26159;&#19968;&#20010;&#23436;&#25972;&#30340;&#36719;&#20214;/&#30828;&#20214;&#31995;&#32479;&#12290;&#34429;&#28982;&#25105;&#20204;&#30340;&#20248;&#30424;&#21644; SSD &#30828;&#30424;&#30456;&#35980;&#24046;&#19981;&#22810;&#65292;&#20294;&#23427;&#20204; FTL &#30340;&#22797;&#26434;&#31243;&#24230;&#20063;&#23436;&#20840;&#19981;&#21516;&#8212;&#8212;SSD &#30340; FTL &#23601;&#26159;&#19968;&#20010;&#23567;&#22411;&#35745;&#31639;&#26426;&#65292;&#36816;&#34892;&#25805;&#20316;&#31995;&#32479;&#21644;&#38378;&#23384;&#31649;&#29702;&#31243;&#24207;&#12290;&#26377;&#20852;&#36259;&#30340;&#21516;&#23398;&#21487;&#20197;&#38405;&#35835;&#25945;&#31185;&#20070;&#12290;SSD &#30340;&#19968;&#20010;&#26174;&#33879;&#30340;&#22909;&#22788;&#23601;&#26159;&#23481;&#37327;&#36234;&#22823;&#65292;&#36895;&#24230;&#36234;&#24555;&#8212;&#8212;&#20511;&#21161;&#20808;&#36827;&#30340;&#21322;&#23548;&#20307;&#24037;&#33402;&#65292;&#38378;&#23384;&#36825;&#31181;&#31867;&#20284;&#20869;&#23384;&#30340;&#32467;&#26500;&#19981;&#20165;&#21487;&#20197;&#20570;&#24471;&#38750;&#24120;&#23494;&#38598;&#65292;&#32780;&#19988;&#21487;&#20197;&#20570;&#24471;&#38750;&#24120;&#24182;&#34892;&#12290;&#21363;&#20415;&#22312;&#20170;&#22825;&#30340;&#28040;&#36153;&#24066;&#22330;&#65292;&#20320;&#20063;&#20250;&#21457;&#29616;&#36890;&#24120;&#26356;&#22823;&#30340; SSD &#26377;&#26356;&#22909;&#30340;&#35835;/&#20889;&#24615;&#33021;&#12290;</p></div>
</div>

<div class="container text-xs py-3">
  <span class="text-muted">
    <center><a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/"><img alt="Creative Commons License" style="border-width:0" src="../../../static/img/cc-4.0.png"></a>
    &#160;&#160;&#160;<a style="color:inherit" href="https://beian.miit.gov.cn/">&#33487; ICP &#22791; 2020049101 &#21495;</a>
    </center>
  </span>
</div>

</div>

<script src="../../../static/js/jquery.min.js"></script>

<script>
function get_token() {
  var match = document.cookie.match(new RegExp('(^| )token=([^;]+)'));
  if (match) return match[2];
  else return "";
}
var token = get_token();
var hint = "token", box = $("#token-input");

if (token == "") { }
else { box.val(token); }

function login() {
  var token = box.val()
  if (!token) {
    document.cookie = ''
  } else {
    document.cookie = 'token=' + token + '; expires=Fri, 31 Dec 9999 23:59:59 GMT;'
  }
}
</script>


</body>

</html>