<!DOCTYPE html><html class="h-100">

<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
  <link href="../static/css/base.css" rel="stylesheet">
  <script src="https://cdn.tailwindcss.com"></script>
  <link href="https://fonts.font.im/css?family=Source+Serif+Pro%7CLato%7CInconsolata" rel="stylesheet" type="text/css">
  <link rel="shortcut icon" href="../static/img/favicon.png" type="image/x-icon">

  <style>
    .font-sans {
      font-family: 'Lato', 'SimHei', 'STHeiti', 'SimHei', 'Serif';
    }
    .font-serif {
      font-family: 'Source Serif Pro', 'Songti SC', 'SimSun', 'Serif', serif;
    }
  </style>
  <link rel="stylesheet" href="../static/katex/katex.min.css">
  <script defer src="../static/katex/katex.min.js"></script>
  <script defer src="../static/katex/auto-render.min.js" integrity="sha384-+VBxd3r6XgURycqtZ117nYw44OOcIax56Z4dCRWbxyPt0Koah1uHoK0o4+/RRE05" crossorigin="anonymous"></script>
  <script>
      document.addEventListener("DOMContentLoaded", function() {
          renderMathInElement(document.body, {
            // customised options
            // &#8226; auto-render specific keys, e.g.:
            delimiters: [
                {left: '$$', right: '$$', display: true},
                {left: '$', right: '$', display: false},
                {left: '\\(', right: '\\)', display: false},
                {left: '\\[', right: '\\]', display: true}
            ],
            // &#8226; rendering keys, e.g.:
            throwOnError : false
          });
      });
  </script>


  

<style>
.article {
  -webkit-hyphens: auto;
}
form {
  margin-block-end: 0;
}
img {
  display: inline-block;
}
code { font-size: 85%; }
pre {
  font-size: 95%;
  line-height: 120%;
}
blockquote {
  font-size: 95%;
}
p {
  font-size: 105%;
  text-indent: 2em;
}
li {
  font-size: 105%;
}
blockquote p {
  text-indent: 0em;
}
.float-right {
  padding-left: 10px;
}
.float-left {
  padding-right: 10px;
}
a {
  color: rgb(29 78 216);
}
strong {
  font-family: 'Lato', 'SimHei', 'STHeiti', 'SimHei', 'Serif';
}
.box        {
  border-radius: 2px; padding: 1px 4px 2px 4px;
  font-family: 'Lato', 'SimHei', 'STHeiti', 'SimHei', 'Serif';
  font-size: 95%;
}
.box-blue,  .badge-primary  { background-color: rgba(66, 139, 202, 0.5); color: #1d4ed8; }
.box-green, .badge-success  { background-color: rgba(92, 184, 92, 0.5);  color: #15803d; }
.box-red,   .badge-danger   { background-color: rgba(217, 83, 79, 0.5);  color: #b91c1c; }
.box-yellow,.badge-warning  { background-color: rgba(240, 173, 78, 0.5); color: #a16207; }
.box-gray   { background-color: #a0a0a0; }

.badge {
  padding: 1 4 1 4;
  display: inline-block;
  border-radius: 0.25rem;
  border: 1px solid;
}
.message p {
  text-indent: 0em;
  margin-top: 1px;
}
.message h1, h2, h3, h4, h5 {
  font-family: 'Lato', 'SimHei', 'STHeiti', 'SimHei', 'Serif';
}
.message h2 {
  font-size: 120%;
  margin-top: 5px;
  margin-bottom: 2px;
}
.message li {
  list-style: disc;
  margin-left: 2em;
}
li > p {
  text-indent: 0em;
}
block-quote h4 {
  float: left;
  display: inline-block;
}
.center {
  display: block;
  margin: auto;
}
hr {
  margin-top: 20px;
  padding-bottom: 20px;
}

.fa-gradient {
	background: -webkit-gradient(linear, left top, left bottom, from(rgb(99, 27, 103)), to(#333));
	-webkit-background-clip: text;
	-webkit-text-fill-color: transparent;
}

</style>


  <title>&#29983;&#23384;&#25351;&#21335;</title>
</head>

<body class="d-flex flex-column h-100">
  
  

<div>

<div class="px-2 py-1 w-full fixed z-50 bg-gradient-to-r from-black via-purple-700 via-purple-500 shadow-lg" style="-webkit-backdrop-filter: saturate(150%) blur(4px); backdrop-filter: saturate(150%) blur(4px)">
  <form>
    <a href="../index.html"><span class="text-lg px-2 text-white">Yanyan's Wiki</span></a>
    <a href="2023/index.html"><span class="text-sm px-2 text-white">&#25805;&#20316;&#31995;&#32479; (2023)</span></a>
    <input maxlength="9" id="token-input" class="float-right appearance-none border border-transparent px-2 py-1 w-20 bg-white text-gray-700 placeholder-gray-400 shadow-md rounded text-xs focus:outline-none focus:ring-2 focus:ring-purple-600 focus:border-transparent font-mono" type="text" placeholder="TOKEN" oninput="login();">
  </form>
</div>

<div class="article container mx-auto md:px-8 lg:px-8 xl:px-8 2xl:px-8 shadow-lg border pb-8 pt-10 max-w-screen-md text-justify divide-y-2 divide-white">
  <div><h1 id="_1" class=" text-2xl mt-2 font-sans">&#29983;&#23384;&#25351;&#21335;</h1>
<blockquote class=" bg-gray-200 p-2 rounded mb-2 mt-2 mx-4">
<h4 id="_2" class=" pt-2 pb-2 font-sans float-left text-sm box border mr-1 mt-1 box-blue" style=" padding-bottom: 0;">&#26680;&#24515;&#25351;&#23548;&#21407;&#21017;</h4>
<p class=" font-serif my-1"><strong>Don't Panic. (&#19981;&#35201;&#24908;)</strong> <span class="float-right">&#8212;&#8212;<em>The Hitchhiker's Guide to the Galaxy</em></span></p>
<p class=" font-serif my-1">&#26366;&#32463; OSLabs &#26159;&#19968;&#20010;&#21487;&#24597;&#30340;&#20256;&#35828;&#65307;&#20294;&#38543;&#30528; jyy &#21608;&#30446;&#30340;&#22686;&#21152; (&#23588;&#20854;&#26159;&#22312;&#25226;&#12298;&#35745;&#31639;&#26426;&#31995;&#32479;&#22522;&#30784;&#12299;&#20174;&#21069;&#23548;&#35838;&#31243;&#20013;&#21435;&#38500;&#21518;)&#65292;&#24863;&#35273;&#36234;&#26469;&#36234;&#33021;&#22312; &#8220;&#25361;&#25112;&#24615;&#8221; &#19982; &#8220;&#36259;&#21619;&#24615;&#8221; &#20043;&#38388;&#25214;&#21040;&#19968;&#20010;&#35753;&#22823;&#23478;&#27963;&#19979;&#21435;&#30340;&#24179;&#34913;&#65306;</p>
<ul class=" list-disc font-serif">
<li class=" ml-8">&#26368;&#20248;&#31168;&#30340;&#21516;&#23398;&#20063;&#24212;&#35813;&#24863;&#21040;&#25361;&#25112;&#12290;&#22312; jyy &#35835;&#20070;&#30340;&#26102;&#20195;&#65292;&#8220;&#26399;&#26411;&#32763;&#19968;&#36941;&#20070;&#23601;&#26377; 95 &#20998;&#8221; &#30340;&#35838;&#31243;&#20284;&#20046;&#19981;&#33021;&#25215;&#25285;&#22823;&#23478;&#20316;&#20026;&#19968;&#21517; &#8220;&#21517;&#26657;&#27605;&#19994;&#29983;&#8221; &#32937;&#36127;&#30340;&#37325;&#20219;</li>
<li class=" ml-8">&#25481;&#22312;&#38431;&#20237;&#20043;&#21518;&#30340;&#21516;&#23398;&#65292;&#21363;&#20415;&#26159;&#20165;&#26377;&#19968;&#23450;&#30340;&#32534;&#31243;&#22522;&#30784;&#65292;&#21162;&#21147;&#36807;&#30340;&#21516;&#23398;&#20063;&#19968;&#23450;&#33021;&#36890;&#36807; (Yes!)</li>
</ul>
</blockquote>
<p class=" font-serif my-1">&#20294;&#26080;&#35770;&#22914;&#20309;&#65292;&#36824;&#26159;&#35201;&#33457;&#28857;&#26102;&#38388;&#35828;&#19968;&#19979;&#24590;&#20040;&#22312;&#36825;&#38376;&#35838;&#29983;&#23384;&#19979;&#26469;&#65292;&#22240;&#20026;<strong>&#35828;&#21040;&#24213;&#25805;&#20316;&#31995;&#32479;&#36824;&#26159;&#19968;&#38376;&#21313;&#20998;&#30828;&#26680;&#30340;&#32534;&#31243;&#35838;</strong>&#12290;</p>
<h2 id="1" class=" text-xl mt-2 pb-2 font-sans">1. &#25805;&#20316;&#31995;&#32479;&#20026;&#20160;&#20040;&#38590;&#23398;&#65311;</h2>
<p class=" font-serif my-1">&#25805;&#20316;&#31995;&#32479;&#38590;&#23398;&#30340;&#26368;&#20027;&#35201;&#21407;&#22240;&#26159;&#25805;&#20316;&#31995;&#32479;&#37324;&#30340;&#20027;&#39064;&#24456;&#22810;&#65292;&#26377;&#20123;&#20027;&#39064;&#23545;&#22823;&#23478;&#26469;&#35828;&#24182;&#19981;&#22826;&#29087;&#24713;&#12290;&#20363;&#22914;&#65292;&#21516;&#23398;&#20204;&#21040;&#30446;&#21069;&#20026;&#27490;&#32534;&#20889;&#30340;&#22823;&#37096;&#20998;&#20195;&#30721;&#37117;&#26159;&#20018;&#34892;&#30340;&#65292;&#25171;&#20010;&#27604;&#26041;&#65292;&#23601;&#26159;&#20889;&#19968;&#20010;&#31243;&#24207;&#27169;&#20223; &#8220;&#19968;&#20010;&#20154;&#8221;&#65292;&#19968;&#27425;&#25191;&#34892;&#19968;&#27493;&#21160;&#20316;&#12290;&#20294;&#25805;&#20316;&#31995;&#32479;&#24341;&#20837;&#20102;&#24182;&#21457;&#32534;&#31243;&#65292;&#20063;&#23601;&#26159;&#20320;&#38656;&#35201;&#21327;&#21516;&#22810;&#20010;&#20849;&#20139;&#20869;&#23384;&#30340; &#8220;&#22810;&#20010;&#20154;&#8221; &#26102;&#65292;&#20250;&#36935;&#21040;&#24456;&#22810;&#20320;&#20063;&#35768;&#24847;&#26009;&#20043;&#22806;&#30340;&#38382;&#39064;&#12290;</p>
<p class=" font-serif my-1">&#22312;&#25805;&#20316;&#31995;&#32479;&#20013;&#65292;&#21738;&#24597;&#25105;&#20204;&#23436;&#20840;&#19981;&#31649;&#22914;&#20309;&#23454;&#29616; &#8220;&#20302;&#24310;&#36831;&#12289;&#39640;&#21534;&#21520;&#30340;&#29275;&#36924;&#29616;&#20195;&#25805;&#20316;&#31995;&#32479;&#8221;&#65292;&#21363;&#20415;&#26159;&#23454;&#29616;&#19968;&#20010;&#26368;&#23567;&#30340;&#33021;&#24037;&#20316;&#30340;&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;&#65292;&#20320;&#20381;&#28982;&#20250;&#36935;&#21040;&#20247;&#22810;&#38750;&#24120;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#65306;</p>
<ul class=" list-disc font-serif">
<li class=" ml-8">&#25805;&#20316;&#31995;&#32479;&#24212;&#35813;&#20026;&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#24590;&#26679;&#30340; API&#65311;</li>
<li class=" ml-8">&#22914;&#20309;&#29992;&#30828;&#20214;&#23454;&#29616;&#22810;&#20010;&#36827;&#31243;&#30340;&#24182;&#21457;/&#24182;&#34892;&#65311;</li>
<li class=" ml-8">&#22914;&#20309;&#32534;&#20889;&#33021;&#22815;&#24037;&#20316;&#30340;&#24182;&#21457;&#31243;&#24207;&#65292;&#23427;&#19981;&#20250;&#22312;&#21387;&#21147;&#36127;&#36733;&#19979;&#38543;&#26102;&#38543;&#22320;&#23849;&#28291;&#65311;</li>
<li class=" ml-8">&#22914;&#20309;&#32500;&#25345;&#22810;&#20010;&#38548;&#31163;&#30340;&#25191;&#34892;&#27969;&#65311;</li>
<li class=" ml-8">&#22914;&#20309;&#22312;&#30913;&#30424;&#19978;&#23454;&#29616;&#25345;&#20037;&#30340;&#25968;&#25454;&#32467;&#26500;&#65311;</li>
<li class=" ml-8">&#8230;&#8230;</li>
</ul>
<p class=" font-serif my-1">&#22312;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#19978;&#20316;&#20986;&#31361;&#20986;&#36129;&#29486;&#30340;&#20154;&#24050;&#32463;&#24471;&#36807; $n$ &#20010;&#22270;&#28789;&#22870;&#20102;&#8212;&#8212;&#27599;&#19968;&#20010;&#38382;&#39064;&#37117;&#19981;&#26159;&#21507;&#32032;&#30340;&#12290;&#35201;&#25226;&#36825;&#20123;&#38382;&#39064;&#30340;&#26469;&#40857;&#21435;&#33033;&#12289;&#35299;&#20915;&#26041;&#27861;&#12289;&#20195;&#30721;&#23454;&#29616;&#37117;&#25484;&#25569;&#22909;&#65292;&#30340;&#30830;&#26159;&#30456;&#24403;&#26377;&#25361;&#25112;&#24615;&#30340;&#12290;</p>
<h2 id="2" class=" text-xl mt-2 pb-2 font-sans">2. &#25805;&#20316;&#31995;&#32479;&#35813;&#24590;&#20040;&#23398;&#65311;</h2>
<p class=" font-serif my-1">&#24184;&#36816;&#30340;&#26159;&#65292;&#25105;&#20204;&#22312;&#22810;&#24180;&#30340;&#32463;&#39564;&#37324;&#25214;&#21040;&#20102;&#29702;&#35299;&#25805;&#20316;&#31995;&#32479;&#30340;&#20004;&#25226; &#8220;&#38053;&#21273;&#8221;&#65292;&#23427;&#20204;&#20998;&#21035;&#25171;&#24320;&#20102;&#25805;&#20316;&#31995;&#32479;&#30340;&#20004;&#20010;&#20391;&#38754;&#12290;</p>
<blockquote class=" bg-gray-200 p-2 rounded mb-2 mt-2 mx-4">
<h4 id="_3" class=" pt-2 pb-2 font-sans float-left text-sm box border mr-1 mt-1 box-blue" style=" padding-bottom: 0;">&#128273;</h4>
<p class=" font-serif my-1"><strong>&#8220;&#31243;&#24207;&#30524;&#20013;&#30340;&#25805;&#20316;&#31995;&#32479;&#8221;&#65306;&#23545;&#35937; + API</strong></p>
<p class=" font-serif my-1">&#25805;&#20316;&#31995;&#32479;&#20026;&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#20102;&#25191;&#34892;&#30340;&#22522;&#30784;&#29615;&#22659;&#12289;&#19968;&#31995;&#21015;&#25805;&#20316;&#31995;&#32479;&#23545;&#35937;&#21644;&#25805;&#20316;&#23427;&#20204;&#30340; API&#8212;&#8212;&#33267;&#23569;&#23545;&#20110;&#20170;&#22825;&#30340;&#25805;&#20316;&#31995;&#32479;&#26469;&#35828;&#65292;&#36825;&#20123;&#19996;&#35199;&#37117;&#26159;&#31934;&#30830;&#23450;&#20041;&#12289;&#35302;&#25163;&#21487;&#21450;&#30340;&#12290;&#25105;&#20204;&#21487;&#20197;&#22312;&#35838;&#22530;&#19978;&#36890;&#36807;&#20195;&#30721;&#29255;&#27573;&#12289;&#35843;&#35797;&#24037;&#20855;&#12289;&#26085;&#24535;&#12289;trace &#31561;&#31561;&#23454;&#22312;&#22320;&#35302;&#25720;&#21040;&#25805;&#20316;&#31995;&#32479;&#20026;&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#30340;&#19968;&#20999;&#12290;</p>
<p class=" font-serif my-1">&#36825;&#23601;&#24110;&#21161;&#25105;&#20204;&#29702;&#35299;&#29616;&#20195;&#25805;&#20316;&#31995;&#32479;<strong>&#35774;&#35745;</strong>&#32972;&#21518;&#30340;&#24605;&#36335;&#12290;</p>
</blockquote>
<p class=" font-serif my-1">&#25105;&#20204;&#20250;&#23398;&#20064;&#30495;&#23454;&#25805;&#20316;&#31995;&#32479;&#20013;&#30340;&#31243;&#24207;&#26159;&#20160;&#20040;&#65292;&#20197;&#21450;&#22914;&#20309;&#20511;&#21161;&#25805;&#20316;&#31995;&#32479;&#25552;&#20379;&#30340; API &#20026;&#25805;&#20316;&#31995;&#32479;&#32534;&#31243;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#30340;&#36873;&#25321;&#26159; Linux (&#20934;&#30830;&#26469;&#35828;&#26159; POSIX) &#20316;&#20026;&#35838;&#31243;&#25945;&#23398;&#30340;&#24179;&#21488;&#65292;&#22240;&#20026;&#23427;&#26082;&#20813;&#36153;&#20063;&#33258;&#30001; (&#33021;&#30693;&#36947;&#23427;&#20869;&#37096;&#30340;&#23454;&#29616;)&#65292;&#32780;&#19988;&#20114;&#32852;&#32593;&#19978;&#26377;&#20016;&#23500;&#30340; (&#33521;&#25991;) &#25991;&#26723;&#12290;&#23427;&#30340;&#35774;&#35745;&#32487;&#25215;&#33258; &#8220;Keep it simple, stupid&#8221; &#30340; UNIX&#65292;&#36825;&#20010;&#32463;&#20856;&#30340;&#35774;&#35745;&#32972;&#21518;&#30340;&#21160;&#26426;&#21453;&#32780;&#26356;&#23481;&#26131;&#20026;&#31532;&#19968;&#27425;&#25509;&#35302;&#25805;&#20316;&#31995;&#32479;&#30340;&#21021;&#23398;&#32773;&#25152;&#29702;&#35299;&#12290;&#35753;&#25105;&#20204;&#30475;&#30475;&#23427;&#30340;&#23041;&#21147;&#65306;</p>
<ul class=" list-disc font-serif">
<li class=" ml-8">&#39318;&#20808;&#65292;&#25805;&#20316;&#31995;&#32479;&#37324;&#30340;&#19968;&#20999;&#23545;&#35937;&#37117;&#29992;&#25991;&#20214;&#34920;&#31034; (Everything is a file)&#12290;&#36827;&#31243;&#12289;&#35774;&#22791;&#8230;&#8230;&#37117;&#21487;&#20197;&#22312;&#20219;&#20309;&#32534;&#31243;&#35821;&#35328;&#37324;&#29992;&#25991;&#20214; API &#35775;&#38382;&#12290;</li>
<li class=" ml-8">Linux &#30340;&#21629;&#20196;&#34892; Shell &#26159;&#19968;&#38376;&#32534;&#31243;&#35821;&#35328;&#8212;&#8212;&#27809;&#38169;&#65292;&#20320;&#27599;&#22825;&#37117;&#22312; &#8220;&#32534;&#31243;&#8221;&#65281;&#26356;&#20934;&#30830;&#22320;&#35828;&#65292;Shell &#30340;&#21151;&#33021;&#23601;&#26159;&#25226;&#20320;&#24819;&#35201;&#20570;&#30340;&#20107;&#24773; (&#31867;&#20284;&#33258;&#28982;&#35821;&#35328;&#25551;&#36848;&#30340;&#20195;&#30721;) &#32763;&#35793;&#25104;&#25805;&#20316;&#31995;&#32479;&#33021;&#30475;&#25026;&#30340;&#25991;&#20214;/&#36827;&#31243;&#31649;&#29702; API &#35843;&#29992;&#12290;</li>
</ul>
<p class=" font-serif my-1">&#36825;&#20351;&#24471;&#25105;&#20204;&#33021;&#29992;&#21069;&#25152;&#26410;&#26377;&#31616;&#20415;&#30340;&#26041;&#24335;&#29609;&#36716;&#25805;&#20316;&#31995;&#32479;&#37324;&#30340;&#20960;&#20046;&#20219;&#20309;&#19996;&#35199;&#12290;&#20320;&#24819;&#30475;&#30475;&#20320;&#30913;&#30424;&#30340;&#20027;&#24341;&#23548;&#25159;&#21306;&#31350;&#31455;&#26159;&#20160;&#20040;&#20195;&#30721;&#65311;&#22909;&#21150;&#65292;&#19968;&#26465;&#21629;&#20196;&#23601;&#34892;&#20102;&#65306;</p>
<div class="codehilite"><pre class=" bg-gray-100 overflow-x-auto rounded p-2 mb-2 mt-2"><span></span><code>cat<span class="w"> </span>/dev/sda<span class="w"> </span><span class="p">|</span><span class="w"> </span>head<span class="w"> </span>-c<span class="w"> </span><span class="m">512</span><span class="w"> </span><span class="p">|</span><span class="w"> </span>ndisasm<span class="w"> </span>-b<span class="w"> </span><span class="m">16</span><span class="w"> </span>-
</code></pre></div>

<p class=" font-serif my-1">&#20320;&#19981;&#29992;&#38405;&#35835;&#22826;&#22810;&#30340;&#25163;&#20876;&#20063;&#33021;&#33258;&#22914;&#22320;&#20316;&#20026;&#19968;&#20010; &#8220;Power User&#8221; &#20351;&#29992;&#23427;&#12290;&#35838;&#31243;&#20013;&#19981;&#26029;&#20250;&#32473;&#22823;&#23478;&#19968;&#20123;&#26377;&#36259;&#30340;&#23567;&#24778;&#21916;&#65292;&#20363;&#22914;&#20026;&#22823;&#23478;&#23637;&#31034;&#35768;&#22810;&#36523;&#36793;&#24037;&#20855;&#30340;&#20195;&#30721;&#8212;&#8212;&#23427;&#20204;&#36890;&#24120;&#26377;&#31616;&#26131;&#29256;&#12289;&#35835;&#24471;&#25026;&#30340;&#23454;&#29616;&#12290;&#27604;&#22914;&#26469;&#33258;&#26089;&#26399;&#29256;&#26412; busybox &#30340; <a href="https://git.busybox.net/busybox/tree/editors/vi.c?h=1_00_stable" class=" text-amber-900">vi &#23454;&#29616;</a> &#21482;&#26377;&#19968;&#20010;&#25991;&#20214;&#12290;&#36825;&#20010;&#25991;&#20214;&#20063;&#35768;&#27604;&#20320;&#20889;&#36807;&#30340;&#20219;&#20309;&#39033;&#30446;&#37117;&#22823; (4000 &#34892;)&#65292;&#20294;&#20320;&#22914;&#26524;&#20351;&#29992;&#27491;&#30830;&#30340;&#24037;&#20855;&#25226;&#20989;&#25968;&#20195;&#30721;&#25240;&#21472;&#36215;&#26469;&#65292;&#20320;&#20250;&#21457;&#29616;&#36825;&#31616;&#21333;&#65292;&#20320;&#20063;&#20889;&#24471;&#20986;&#12290;</p>
<p class=" font-serif my-1">&#21253;&#25324;&#20026;&#20102;&#24110;&#21161;&#22823;&#23478;&#26356;&#22909;&#22320;&#29702;&#35299; UNIX/Linux &#25805;&#20316;&#31995;&#32479;&#30340;&#35774;&#35745; (&#21363;&#25805;&#20316;&#31995;&#32479;&#21040;&#24213;&#20026;&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#20102;&#20160;&#20040;&#23545;&#35937;&#20197;&#21450;&#25805;&#20316;&#36825;&#20123;&#23545;&#35937;&#30340; API)&#65292;&#25105;&#20204;&#35774;&#32622;&#20102;&#33509;&#24178; Linux &#31995;&#32479;&#19978;&#30340; Mini Programming Labs&#65292;&#27599;&#20010; 200 &#34892;&#24038;&#21491;&#30340;&#20195;&#30721;&#65292;&#23454;&#38469;&#35843;&#29992; Linux &#25805;&#20316;&#31995;&#32479; API &#23436;&#25104;&#19968;&#20123;&#20165;&#20351;&#29992; C &#26631;&#20934;&#24211;&#38590;&#20197;&#21150;&#21040;&#30340;&#20219;&#21153;&#12290;</p>
<blockquote class=" bg-gray-200 p-2 rounded mb-2 mt-2 mx-4">
<h4 id="_4" class=" pt-2 pb-2 font-sans float-left text-sm box border mr-1 mt-1 box-blue" style=" padding-bottom: 0;">&#128273;</h4>
<p class=" font-serif my-1"><strong>&#8220;&#30828;&#20214;&#30524;&#20013;&#30340;&#25805;&#20316;&#31995;&#32479;&#8221;&#65306;&#31243;&#24207; (&#29366;&#24577;&#26426;)</strong></p>
<p class=" font-serif my-1">&#22914;&#26524;&#20320;&#23436;&#20840;&#29702;&#35299;&#20102;&#25805;&#20316;&#31995;&#32479;&#20013;&#26377;&#20160;&#20040;&#23545;&#35937;&#12289;&#22914;&#20309;&#25805;&#32437;&#23427;&#20204;&#65292;&#23601;&#21482;&#21097;&#19968;&#20010;&#38382;&#39064;&#65306;&#20320;&#33021;&#29992;&#35745;&#31639;&#26426;&#30828;&#20214;&#25552;&#20379;&#30340;&#26426;&#21046;&#25226;&#36825;&#20123;&#23545;&#35937;&#21644; API &#23454;&#29616;&#20986;&#26469;&#21527;&#65311;&#23454;&#38469;&#19978;&#65292;&#36816;&#31639;&#21644;&#35775;&#23384;&#25351;&#20196;&#12289;I/O&#12289;&#20013;&#26029;/&#24322;&#24120;&#21644;&#34394;&#23384;&#23601;&#26159;&#25105;&#20204;&#23454;&#29616;&#25805;&#20316;&#31995;&#32479;&#25152;&#38656;&#30340;&#20840;&#37096;&#12290;</p>
<p class=" font-serif my-1">&#36890;&#36807;&#38405;&#35835;&#20195;&#30721;&#21644;&#35843;&#35797;&#19968;&#20010;&#30495;&#27491;&#30340;&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;<strong>&#23454;&#29616;</strong>&#65292;&#25105;&#20204;&#26368;&#32456;&#29702;&#35299;&#25805;&#20316;&#31995;&#32479;&#30340;&#20840;&#37096;&#12290;</p>
</blockquote>
<p class=" font-serif my-1">UNIX &#33258;&#35806;&#29983;&#20197;&#26469;&#65292;&#23601;&#19981;&#26029;&#26377;&#20154;&#22312;&#27169;&#20223;&#8212;&#8212;&#19968;&#20010;&#25104;&#21151;&#30340;&#20363;&#23376;&#23601;&#26159; Linux&#65292;&#22312;&#23427;&#20043;&#19978;&#36824;&#26377;&#25110;&#35768;&#26356;&#20026;&#25104;&#21151;&#30340; Android&#12290;&#24403;&#28982;&#65292;UNIX &#36824;&#26377;&#26356;&#22810; &#8220;&#36855;&#20320;&#29256;&#8221; &#30340;&#26367;&#20195;&#23454;&#29616;&#65292;&#33021;&#23481;&#26131;&#22320;&#24110;&#21161;&#22823;&#23478;&#29702;&#35299;&#20195;&#30721;&#32972;&#21518;&#30340;&#21407;&#29702;&#12290;&#25105;&#20204;&#22312;&#35838;&#22530;&#19978;&#36873;&#29992; <a href="http://pdos.csail.mit.edu/6.S081/xv6" class=" text-amber-900">xv6-riscv</a> &#20316;&#20026;&#35762;&#35299;&#25805;&#20316;&#31995;&#32479;&#30340;&#20363;&#23376;&#12290;&#21516;&#26102;&#65292;&#22823;&#23478;&#20063;&#38656;&#35201;&#22312; Operating System Labs &#20013;&#65292;&#20174; &#8220;&#35064;&#26426;&#8221; (bare-metal) &#32534;&#31243;&#24320;&#22987;&#65292;&#33258;&#24213;&#21521;&#19978;&#23454;&#29616;&#19968;&#20010;&#25903;&#25345;&#22810;&#22788;&#29702;&#22120;&#12289;&#25991;&#20214;&#31995;&#32479;&#12289;&#34394;&#25311;&#23384;&#20648;&#30340;&#36855;&#20320;&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;&#12290; </p>
<h2 id="3" class=" text-xl mt-2 pb-2 font-sans">3. &#25805;&#20316;&#31995;&#32479;&#35838;&#20013;&#30340;&#20195;&#30721;</h2>
<h3 id="31" class=" text-lg mt-2 pb-2 font-sans">3.1 &#36808;&#20986;&#31532;&#19968;&#27493;</h3>
<p class=" font-serif my-1">&#22914;&#26524;&#20320;&#36824;&#27809;&#26377;&#20837;&#38376;&#65292;&#20173;&#28982;&#24863;&#21040;&#24656;&#24807;&#65292;&#35831;&#35760;&#20303;&#65306;&#22362;&#25345;&#20303;&#65292;&#36827;&#20837;&#26410;&#30693;&#39046;&#22495;&#65292;<red><strong>&#20174;&#31616;&#21333;&#30340;&#12289;&#33021;&#29702;&#35299;&#30340;&#19996;&#35199;&#35797;&#36215;&#65292;&#25237;&#20837;&#26102;&#38388;&#65292;&#23601;&#26377;&#25910;&#33719;</strong></red>&#12290;<a href="OS_References.html" class=" text-amber-900">&#21442;&#32771;&#36164;&#26009;</a>&#20013;&#26377;&#19968;&#20123;&#38750;&#24120;&#26834;&#30340;&#20837;&#38376;&#26448;&#26009;&#65292;&#20363;&#22914; &#8220;Harley Hahn's Guide to Unix and Linux&#8221;&#65292;&#24341;&#20154;&#20837;&#32988; (&#36825;&#26412;&#20070;&#19981;&#26159;&#20889;&#32473;&#35745;&#31639;&#26426;&#19987;&#19994;&#20154;&#22763;&#30340;&#65292;&#25152;&#20197;&#23427;&#24322;&#24120;&#22909;&#35835;&#19988;&#26377;&#20013;&#25991;&#29256;)&#12290;&#20174;&#36825;&#37324;&#24320;&#22987;&#65292;&#20320;&#23601;&#33021;&#24930;&#24930;&#20811;&#26381;&#24656;&#24807;&#20102;&#12290;</p>
<p class=" font-serif my-1">&#21516;&#26679;&#65292;&#20320;&#21487;&#33021;&#20250;&#23545;&#19968;&#23567;&#27573;&#31243;&#24207; (&#20363;&#22914;&#35838;&#22530;&#19978;&#30340;&#31034;&#20363;&#20195;&#30721;) &#24863;&#21040;&#38590;&#20197;&#29702;&#35299;&#12290;&#31243;&#24207;&#38590;&#35835;&#26159;&#24456;&#27491;&#24120;&#30340;&#8212;&#8212;&#20294;&#31243;&#24207;&#30340;&#36816;&#34892;&#26102;&#29366;&#24577;&#26159;&#22909;&#29702;&#35299;&#30340;&#12290;&#26080;&#38750;&#23601;&#26159;&#25968;&#23383;&#21644;&#25351;&#38024;&#22043;&#12290;&#35831;&#20320;&#21191;&#25954;&#22320;&#25171;&#24320;&#20320;&#30340;&#35843;&#35797;&#22120;&#65292;&#35774;&#32622;&#19968;&#20010;&#26029;&#28857;&#65292;&#21333;&#27493;&#25191;&#34892;&#20320;&#30340;&#31243;&#24207;&#12290;&#19981;&#30693;&#36947;&#24590;&#20040;&#35843;&#35797;&#65311;&#35843;&#35797;&#30340;&#26102;&#20505;&#27809;&#26377;&#20195;&#30721;&#65311;&#20320;&#38656;&#35201;&#19975;&#33021;&#30340;&#20114;&#32852;&#32593;&#12290;</p>
<p class=" font-serif my-1">&#25105;&#20204;&#20026;&#22823;&#23478;&#20934;&#22791;&#20102;&#19968;&#20123;&#38405;&#35835;&#26448;&#26009;&#12290;&#22914;&#26524;&#20320;&#33021;<red><strong>&#22312;&#20114;&#32852;&#32593;&#25163;&#20876;&#30340;&#36741;&#21161;&#19979;</strong></red>&#29702;&#35299;&#19979;&#38754;&#30340; &#8220;&#33258;&#27979;&#8221; &#20869;&#23481;&#65292;&#12298;&#25805;&#20316;&#31995;&#32479;&#12299;&#23545;&#20320;&#26469;&#35828;&#23601;&#26159;&#30456;&#24403;&#21512;&#36866;&#30340;&#65281;</p>
<h3 id="32-c" class=" text-lg mt-2 pb-2 font-sans">3.2 &#33258;&#27979;&#65306;C &#35821;&#35328;&#32534;&#31243;</h3>
<p class=" font-serif my-1">&#30452;&#21040;&#20170;&#22825;&#36825;&#38376;&#35838;&#20381;&#28982;&#20351;&#29992; C &#35821;&#35328;&#12290;&#22312;&#38416;&#36848;&#25805;&#20316;&#31995;&#32479;&#21407;&#29702;&#26041;&#38754;&#65292;&#23427;&#26356;&#31616;&#21333;&#12289;&#21253;&#34993;&#26356;&#23569;&#65292;&#20063;&#27809;&#26377;&#24456;&#24222;&#22823;&#30340;&#24037;&#20855;&#38142;&#12290;&#34429;&#28982;&#35828;&#36825;&#30456;&#24403;&#20110; &#8220;&#25226;&#20320;&#30340;&#25163;&#33050;&#25414;&#36215;&#26469;&#32534;&#31243;&#8221;&#65292;&#20294;&#25105;&#20204;&#36890;&#24120;&#19981;&#38656;&#35201;&#24456;&#22797;&#26434;&#30340;&#25968;&#25454;&#32467;&#26500;&#21644;&#20195;&#30721;&#36923;&#36753;&#65292;&#22240;&#27492;&#29616;&#20195;&#35821;&#35328;&#29305;&#24615;&#30340;&#22909;&#22788;&#22312;&#22823;&#37096;&#20998;&#26102;&#20505;&#24182;&#19981;&#26174;&#33879;&#12290;&#32780;&#19988;&#29992; C &#35821;&#35328;&#36824;&#26377;&#19968;&#20123;&#39069;&#22806;&#30340;&#22909;&#22788;&#65306;</p>
<ul class=" list-disc font-serif">
<li class=" ml-8">&#21644;&#20854;&#20182;&#32534;&#31243;&#35821;&#35328;&#30456;&#27604;&#65292;C &#35821;&#35328;&#29305;&#24615;&#26356;&#23481;&#26131;&#30495;&#27491;&#25484;&#25569;&#21644;&#28145;&#20837;&#29702;&#35299;&#12290;&#22914;&#26524;&#20320;&#27809;&#26377;&#23398;&#22909;&#65292;&#29992;&#20960;&#21608;&#30340;&#26102;&#38388;&#34917;&#19978;&#24212;&#35813;&#20063;&#27809;&#38382;&#39064;</li>
<li class=" ml-8">C &#26159;&#19968;&#31181; &#8220;&#39640;&#32423;&#30340;&#27719;&#32534;&#35821;&#35328;&#8221;&#65292;&#20320;&#19981;&#38590;&#22312;&#22823;&#33041;&#37324;&#25226; C &#20986;&#20195;&#30721;&#32763;&#35793;&#25104;&#25351;&#20196;&#24207;&#21015;&#65307;&#20294;&#23545;&#20110;&#29616;&#20195;&#35821;&#35328;&#26469;&#35828;&#65292;&#36825;&#35201;&#22256;&#38590;&#24471;&#22810;</li>
<li class=" ml-8">&#36879;&#36807;&#23545; C &#35821;&#35328;&#30340;&#28145;&#20837;&#29702;&#35299;&#65292;&#21487;&#20197;&#26356;&#22909;&#22320;&#29702;&#35299;&#29616;&#20195;&#32534;&#31243;&#35821;&#35328;&#30340;&#35774;&#35745;&#21160;&#26426;&#21644;&#23454;&#29616;&#26041;&#27861;</li>
</ul>
<p class=" font-serif my-1">&#19968;&#20010;&#20363;&#23376;&#26159; &#8220;&#38754;&#21521;&#23545;&#35937;&#8221;&#65292;&#25105;&#20204;&#22312; C &#37324;&#20063;&#21487;&#20197;&#23454;&#29616;</p>
<div class="codehilite"><pre class=" bg-gray-100 overflow-x-auto rounded p-2 mb-2 mt-2"><span></span><code><span class="k">struct</span><span class="w"> </span><span class="nc">foo</span><span class="w"> </span><span class="p">{</span>
<span class="w">  </span><span class="kt">int</span><span class="w"> </span><span class="p">(</span><span class="o">*</span><span class="n">bar</span><span class="p">)(</span><span class="k">struct</span><span class="w"> </span><span class="nc">foo</span><span class="w"> </span><span class="o">*</span><span class="n">this</span><span class="p">,</span><span class="w"> </span><span class="kt">int</span><span class="w"> </span><span class="n">a</span><span class="p">,</span><span class="w"> </span><span class="kt">int</span><span class="w"> </span><span class="n">b</span><span class="p">);</span><span class="w"> </span><span class="c1">// &#20989;&#25968;&#25351;&#38024;</span>
<span class="p">};</span>

<span class="kt">void</span><span class="w"> </span><span class="nf">baz</span><span class="p">()</span><span class="w"> </span><span class="p">{</span>
<span class="w">  </span><span class="k">struct</span><span class="w"> </span><span class="nc">foo</span><span class="w"> </span><span class="o">*</span><span class="n">ptr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">get_object</span><span class="p">();</span>
<span class="w">  </span><span class="n">ptr</span><span class="o">-&gt;</span><span class="n">bar</span><span class="p">(</span><span class="n">ptr</span><span class="p">,</span><span class="w"> </span><span class="mi">3</span><span class="p">,</span><span class="w"> </span><span class="mi">4</span><span class="p">);</span>
<span class="w">  </span><span class="c1">// &#31561;&#25928;&#20110;C++: ptr-&gt;bar(3, 4)</span>
<span class="p">}</span>
</code></pre></div>

<p class=" font-serif my-1">&#32780; C++ &#37324;&#30340;&#23545;&#35937;&#65292;&#30340;&#30830;&#20063;&#26159;&#36825;&#26679; (&#31867;&#20284;) &#23454;&#29616;&#30340;&#12290;&#22914;&#26524;&#35201;&#23454;&#29616;&#21160;&#24577;&#32465;&#23450; (&#29992;&#29238;&#31867;&#30340;&#25351;&#38024;&#35843;&#29992;&#23376;&#31867;&#30340;&#26041;&#27861;)&#65292;&#25105;&#20204;&#21482;&#38656;&#25226;&#34394;&#20989;&#25968;&#30340;&#20837;&#21475;&#25918;&#21040;&#19968;&#24352;&#34920;&#20013;&#65292;&#36890;&#36807;&#26597;&#34920;&#24471;&#21040;&#20989;&#25968;&#23454;&#38469;&#30340;&#20837;&#21475;&#22320;&#22336;&#65306;</p>
<div class="codehilite"><pre class=" bg-gray-100 overflow-x-auto rounded p-2 mb-2 mt-2"><span></span><code><span class="k">struct</span><span class="w"> </span><span class="nc">object_header</span><span class="w"> </span><span class="p">{</span>
<span class="w">  </span><span class="kt">void</span><span class="w"> </span><span class="o">**</span><span class="n">vptr</span><span class="p">;</span>
<span class="p">};</span>

<span class="k">struct</span><span class="w"> </span><span class="nc">foo</span><span class="w"> </span><span class="p">{</span>
<span class="w">  </span><span class="k">struct</span><span class="w"> </span><span class="nc">object_header</span><span class="w"> </span><span class="n">header</span><span class="p">;</span>
<span class="w">  </span><span class="p">...</span>
<span class="p">};</span>

<span class="kt">void</span><span class="w"> </span><span class="n">baz</span><span class="w"> </span><span class="p">{</span>
<span class="w">  </span><span class="k">struct</span><span class="w"> </span><span class="nc">foo</span><span class="w"> </span><span class="o">*</span><span class="n">ptr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">get_object</span><span class="p">();</span>
<span class="w">  </span><span class="c1">// ptr-&gt;bar(3, 4), dynamic binding</span>
<span class="w">  </span><span class="c1">// INDEX_OF_BAR&#22312;&#32534;&#35793;&#26102;&#30001;&#32534;&#35793;&#22120;&#30830;&#23450;</span>
<span class="w">  </span><span class="p">(</span><span class="kt">int</span><span class="w"> </span><span class="p">(</span><span class="o">*</span><span class="p">)(</span><span class="kt">void</span><span class="w"> </span><span class="o">*</span><span class="p">,</span><span class="w"> </span><span class="kt">int</span><span class="p">,</span><span class="w"> </span><span class="kt">int</span><span class="p">))</span><span class="w"> </span><span class="p">(</span><span class="n">ptr</span><span class="o">-&gt;</span><span class="n">header</span><span class="p">.</span><span class="n">vptr</span><span class="p">[</span><span class="n">INDEX_OF_BAR</span><span class="p">])</span><span class="w"> </span><span class="p">(</span><span class="n">ptr</span><span class="p">,</span><span class="w"> </span><span class="mi">3</span><span class="p">,</span><span class="w"> </span><span class="mi">4</span><span class="p">);</span>
<span class="p">}</span>
</code></pre></div>

<p class=" font-serif my-1">&#33021;&#29702;&#35299;&#19978;&#36848;&#30340;&#20363;&#23376;&#65292;&#35828;&#26126;&#20320;&#24050;&#32463;&#26377;&#30456;&#24403;&#25166;&#23454;&#30340; C &#35821;&#35328;&#22522;&#30784;&#20102;&#12290;&#22914;&#26524;&#19981;&#33021;&#65292;&#24314;&#35758;&#22823;&#23478;&#38405;&#35835;&#21442;&#32771;&#20070;&#20013;&#25512;&#33616;&#30340; &#8220;The C programming language&#8221;&#12290;</p>
<blockquote class=" bg-gray-200 p-2 rounded mb-2 mt-2 mx-4">
<h4 id="_5" class=" pt-2 pb-2 font-sans float-left text-sm box border mr-1 mt-1 box-blue" style=" padding-bottom: 0;">&#24605;&#32771;&#39064;&#65306;&#22810;&#37325;&#32487;&#25215;</h4>
<p class=" font-serif my-1">C++ &#25903;&#25345;&#22810;&#37325;&#32487;&#25215;&#65292;&#21363;&#19968;&#20010;&#31867;&#21487;&#20197;&#25317;&#26377;&#20004;&#20010;&#29238;&#31867;&#12290;&#20320;&#24819;&#21040;&#22810;&#37325;&#32487;&#25215;&#30340;&#23454;&#29616;&#26041;&#27861;&#20102;&#21527;&#65311;&#22810;&#37325;&#32487;&#25215;&#30340;&#23454;&#29616;&#26159;&#25226;&#22810;&#20010;&#29238;&#31867;&#21516;&#26102;&#23884;&#20837;&#36827;&#26469; (&#20250;&#25317;&#26377;&#20004;&#20010; <code>header</code>)&#12290;&#32534;&#35793;&#22120;&#20250;&#22788;&#29702;&#22909;&#35843;&#29992;&#12289;&#21160;&#24577;&#32465;&#23450;&#31561;&#38382;&#39064;&#12290;</p>
<p class=" font-serif my-1">&#20174;&#20889; C &#31243;&#24207;&#30340;&#35282;&#24230; (&#25805;&#20316;&#31995;&#32479;&#20063;&#23601;&#26159;&#20010;&#36816;&#34892;&#22312;&#35745;&#31639;&#26426;&#30828;&#20214;&#19978;&#30340; C &#31243;&#24207;)&#65292;&#25152;&#35859; &#8220;&#32534;&#31243;&#8221; &#19981;&#36807;&#26159;&#29992;&#37027;&#20123;&#32534;&#31243;&#35821;&#35328;&#25552;&#20379;&#30340;&#26426;&#21046;&#65292;&#25226;&#20869;&#23384;&#37324;&#30340;&#25968;&#25454;&#21462;&#20986;&#26469;&#65292;&#31639;&#19968;&#31639;&#65292;&#20877;&#25918;&#22238;&#21435;&#12290;There is <em>no</em> magic in computer systems.</p>
</blockquote>
<p class=" font-serif my-1">&#21482;&#26377;&#22312;&#27877;&#28525;&#37324;&#25720;&#29228;&#28378;&#25171;&#24456;&#22810;&#24180;&#65292;&#27515;&#20102;&#19968;&#27425;&#21448;&#19968;&#27425;&#65292;&#25165;&#33021;&#20307;&#20250; C++11/14/17/20+, Rust, Go &#31561;&#29616;&#20195;&#31243;&#24207;&#35774;&#35745;&#35821;&#35328;&#30340;&#33391;&#33510;&#29992;&#24515;&#12290;</p>
<h3 id="33" class=" text-lg mt-2 pb-2 font-sans">3.3 &#33258;&#27979;&#65306;&#32534;&#31243;&#25216;&#24039;</h3>
<p class=" font-serif my-1">&#36873;&#20462;&#36807;&#12298;&#35745;&#31639;&#26426;&#31995;&#32479;&#22522;&#30784;&#12299;&#65292;&#25110;&#26159;&#20219;&#20309;&#24320;&#21457;&#36807;&#30456;&#24403;&#35268;&#27169;&#39033;&#30446;&#30340;&#30340;&#21516;&#23398;&#19968;&#23450;&#24050;&#32463;&#32463;&#21382;&#36807;&#35843;&#35797; bug &#30340;&#22121;&#26790;&#12290;&#26080;&#25968;&#27425;&#20320;&#25171;&#31639;&#25918;&#24323; (&#25110;&#32773;&#23454;&#38469;&#25918;&#24323;)&#65292;&#25110;&#36873;&#25321;&#19981;&#35201;&#26576;&#20010; labs/PA &#30340;&#25104;&#32489;&#65292;&#25110;&#36873;&#25321;&#25265;&#22823;&#33151;&#21516;&#23398;&#30340;&#23454;&#29616;&#8230;&#8230;&#20320;&#20204;&#20570;&#20986;&#30340;&#22949;&#21327;&#37117;&#21487;&#20197;&#29702;&#35299;&#65292;&#20294;&#22312;&#36825;&#20010;&#36807;&#31243;&#20013;&#24573;&#30053;&#30340;&#35843;&#35797;&#32463;&#39564;&#65292;&#21482;&#20250;&#35753;&#20320;&#20204;&#22312;&#35843;&#35797;&#36234;&#26469;&#36234;&#22823;&#31995;&#32479;&#30340;&#26102;&#20505;&#36234;&#26469;&#36234;&#21507;&#21147;&#12290;</p>
<p class=" font-serif my-1">&#25105;&#20204;&#30340;&#33258;&#27979;&#38382;&#39064;&#26159;&#65306;&#22914;&#26524;&#20320;&#19968;&#20010;&#24456;&#22823;&#30340;&#39033;&#30446;&#21457;&#29616;&#20102; bug (&#20551;&#35774;&#20320;&#21487;&#20197;&#31283;&#23450;&#22320;&#37325;&#29616;&#23427;)&#65292;&#20320;&#24212;&#35813;&#22914;&#20309;&#25214;&#21040;&#20986;&#38382;&#39064;&#30340;&#22320;&#26041;&#25152;&#22312;&#65311;</p>
<ul class=" list-disc font-serif">
<li class=" ml-8"><code>printf</code> &#26159;&#20010;&#24456;&#19981;&#38169;&#30340;&#26041;&#27861;&#65307;&#20294;&#20320;&#36935;&#21040;&#36807;&#33457;&#36153;&#24456;&#38271;&#26102;&#38388;&#20063;&#27809;&#26377;&#25214;&#21040; bug &#30340;&#24773;&#20917;&#20040;&#65311;</li>
<li class=" ml-8">&#22914;&#26524; <code>printf</code> &#24110;&#21161;&#20320;&#25214;&#21040;&#20102;&#19968;&#20123;&#32447;&#32034;&#65292;&#22914;&#20309;&#36827;&#19968;&#27493;&#24555;&#36895;&#30830;&#23450;&#38382;&#39064;&#30340; root cause&#65311;</li>
<li class=" ml-8">&#22914;&#26524;&#39033;&#30446;&#24456;&#22823;&#65292;&#20351;&#29992;&#35843;&#35797;&#22120;&#21333;&#27493;&#23601;&#26377;&#20123;&#22826;&#32321;&#29712;&#20102;&#12290;&#20320;&#26377;&#20160;&#20040;&#25216;&#24039;&#65311;(&#20363;&#22914; watch point)</li>
</ul>
<p class=" font-serif my-1">&#22914;&#26524;&#20320;&#23545;&#36825;&#20123;&#38382;&#39064;&#24515;&#37324;&#37117;&#26377;&#19968;&#20123;&#31572;&#26696;&#65292;&#37027;&#31069;&#36154;&#20320;&#65281;&#22914;&#26524;&#20320;&#19968;&#30452;&#22312;&#20351;&#29992; &#8220;&#34542;&#21147;&#8221; &#35843;&#35797;&#65292;&#30340;&#30830;&#26377;&#21487;&#33021;&#36807;&#21435;&#30340;&#20195;&#30721;&#20320;&#36824;&#33021;&#22788;&#29702;&#65292;&#20294;&#23545;&#20110;&#35268;&#27169;&#19981;&#26029;&#22686;&#38271;&#30340;&#20195;&#30721;&#65292;&#36825;&#23601;&#26377;&#20123;&#34892;&#19981;&#36890;&#20102;&#12290;</p>
<blockquote class=" bg-gray-200 p-2 rounded mb-2 mt-2 mx-4">
<h4 id="_6" class=" pt-2 pb-2 font-sans float-left text-sm box border mr-1 mt-1 box-blue" style=" padding-bottom: 0;">&#24605;&#32771;&#39064;&#65306;&#24590;&#26679;&#23613;&#21487;&#33021;&#32534;&#20986;<strong>&#27491;&#30830;</strong>&#30340;&#20195;&#30721;&#65311;</h4>
<p class=" font-serif my-1">&#22312; &#8220;&#38754;&#21521; OJ &#32534;&#31243;&#8221; &#25104;&#20026;&#20064;&#24815;&#20197;&#21518;&#65292;&#32534;&#31243;&#19981;&#36807; &#8220;&#26159;&#27979;&#35797; $\to$ &#19981;&#36890;&#36807; $\to$ &#20462;&#25913;&#8221; &#30340;&#24490;&#29615;&#12290;&#20294;&#22914;&#26524;&#20320;&#24076;&#26395;<strong>&#35828;&#26381;&#21035;&#20154;&#20320;&#30340;&#20195;&#30721;&#30495;&#30340;&#26159;&#23545;&#30340;</strong>&#65292;&#20320;&#26377;&#20160;&#20040;&#21150;&#27861;&#21527;&#65311;</p>
<p class=" font-serif my-1">&#35797;&#30528;&#25552;&#21069;&#24819;&#19968;&#24819;&#36825;&#20010;&#38382;&#39064;&#12290;&#36825;&#20010;&#23398;&#26399;&#37324;&#65292;&#22823;&#23478;&#20250;&#38754;&#23545;&#22810;&#32447;&#31243;&#24182;&#21457;&#30340;&#32534;&#31243;&#65292;&#36825;&#26102;&#20505;&#31243;&#24207;&#30340;&#27491;&#30830;&#24615;&#23601;&#23588;&#20026;&#37325;&#35201;&#65292;&#21482;&#38752; &#8220;&#30450;&#35797;&#8221; &#23601;&#26377;&#20123;&#19981;&#22815;&#20102;&#12290;</p>
</blockquote>
<h2 id="4" class=" text-xl mt-2 pb-2 font-sans">4. &#20854;&#20182;&#24120;&#35265;&#38382;&#39064;</h2>
<ul class=" list-disc font-serif">
<li class=" ml-8">Q: <strong>&#35828;&#22909;&#30340;&#25805;&#20316;&#31995;&#32479;&#21602;&#65311;&#20026;&#20160;&#20040;&#27809;&#26377;&#22270;&#24418;&#30028;&#38754;&#65311;&#65311;&#65311;&#25105;&#26159;&#19981;&#26159;&#23398;&#20102;&#20551;&#30340;&#25805;&#20316;&#31995;&#32479;&#65311;&#65311;&#65311;&#65311;</strong></li>
<li class=" ml-8">
<p class=" font-serif my-1">A: &#20320;&#22914;&#26524;&#25226;&#32456;&#31471;&#30340;&#27599;&#19968;&#20010;&#23383;&#31526;&#30475;&#25104;&#26159;&#20687;&#32032;&#28857;&#65292;&#37027;&#32456;&#31471;&#20063;&#21193;&#24378;&#31639;&#26159;&#20010; &#8220;&#22270;&#24418;&#8221; &#30028;&#38754;&#20102;&#12290;</p>
<p class=" font-serif my-1">&#23454;&#38469;&#19978;&#65292;&#25805;&#20316;&#31995;&#32479;&#20063;&#26159;&#36825;&#20040;&#31649;&#29702;&#22270;&#24418;&#30028;&#38754;&#30340;&#8212;&#8212;&#30001;&#19968;&#20010;&#31243;&#24207; (&#21487;&#33021;&#36816;&#34892;&#22312; GPU &#19978;) &#31639;&#20986;&#27599;&#20010;&#20687;&#32032;&#28857;&#35813;&#26174;&#31034;&#20160;&#20040;&#39068;&#33394;&#65292;&#23601;&#20687; vi &#22312;&#32456;&#31471;&#19978;&#26174;&#31034;&#23383;&#31526;&#12289;&#23548;&#33322;&#26639;&#19968;&#26679;&#12290;&#24403;&#20687;&#32032;&#28857;&#36275;&#22815;&#23567;&#30340;&#26102;&#20505;&#65292;&#20320;&#23601;&#26377;&#22270;&#24418;&#30340;&#24863;&#35273;&#20102;&#65306;</p>
<p class=" font-serif my-1"><img alt="" class="center" src="../pages/OS/img/ascii-patrol.gif" width="100%"></p>
<p class=" font-serif my-1">(<a href="http://ascii-patrol.com/" class=" text-amber-900">ASCII Patrol</a>&#65306;&#19978;&#38754;&#30340; &#8220;&#22270;&#24418;&#8221; &#30495;&#30340;&#37117;&#26159; ASCII &#23383;&#31526;&#32452;&#25104;&#30340;&#65281;)</p>
<p class=" font-serif my-1">&#24403;&#28982;&#65292;&#22270;&#24418;&#32472;&#21046;&#28041;&#21450;&#21040;&#30340;&#30693;&#35782;&#22826;&#22810;&#65292;&#35838;&#31243;&#19978;&#23601;&#19981;&#22810;&#21872;&#21990;&#20102;&#65292;&#20551;&#35013;&#33021;&#23436;&#25104;&#36825;&#20010;&#31867;&#27604;&#65292;&#26080;&#27861;&#20551;&#35013;&#30340;&#21516;&#23398;&#21487;&#20197;&#36873;&#20462;&#33879;&#21517;&#30340; <a href="https://sites.cs.ucsb.edu/~lingqi/teaching/games101.html" class=" text-amber-900">Games 101</a>&#12290;</p>
</li>
</ul>
<hr>

<ul class=" list-disc font-serif">
<li class=" ml-8">Q: <strong>&#20026;&#20160;&#20040;&#19981;&#26159;C++/Go/Rust/...?</strong></li>
<li class=" ml-8">
<p class=" font-serif my-1">A: <strong>&#25105;&#20204;&#24182;&#19981;&#38656;&#35201; &#8220;&#26356;&#39640;&#32423;&#8221; &#30340;&#35821;&#35328;&#65292;&#20381;&#28982;&#21487;&#20197;&#32534;&#20889;&#20248;&#38597;&#12289;&#28145;&#21051;&#30340;&#20195;&#30721;&#65292;&#36825;&#23545;&#21021;&#23398;&#32773;&#26469;&#35828;&#23588;&#20026;&#37325;&#35201;&#65292;&#19981;&#20250; &#8220;&#39038;&#27492;&#22833;&#24444;&#8221;</strong>&#12290;</p>
<p class=" font-serif my-1">&#22909;&#30340;&#35821;&#35328;&#29305;&#24615;&#20351;&#31243;&#24207;&#21464;&#24471;&#20248;&#38597;&#8212;&#8212;&#20294;&#23545;&#20110;&#21021;&#23398;&#32773;&#65292;&#36825;&#20123;&#29305;&#24615;&#32972;&#21518;&#30340;&#19996;&#35199; (&#20363;&#22914; C++ RTTI) &#21487;&#33021;&#32473;&#20320;&#24102;&#26469;&#26410;&#30693;&#30340;&#40635;&#28902;&#12290;&#32780;&#22312;&#36825;&#38376;&#35838;&#19978;&#65292;&#36864;&#19968;&#27493;&#24182;&#27809;&#26377;&#20160;&#20040;&#25439;&#22833;&#65306;&#25105;&#20204;&#19981;&#38656;&#35201;&#23454;&#29616;&#20160;&#20040;&#39640;&#32423;&#25968;&#25454;&#32467;&#26500;&#65307;&#29992; C &#35821;&#35328;&#20063;&#33021;&#20889;&#20986;&#20248;&#38597;&#30340;&#20195;&#30721;&#65292;&#23601;&#20687; xv6 &#37027;&#26679;&#12290;&#36824;&#26377;&#20004;&#28857;&#39069;&#22806;&#22909;&#22788;&#65306;</p>
<ul class=" list-disc font-serif">
<li class=" ml-8">C &#35821;&#35328;&#20195;&#30721;&#22987;&#32456;&#26377;&#38750;&#24120;&#30452;&#30333;&#30340;&#27719;&#32534;&#35821;&#35328;&#19968;&#33268;&#24615;&#12290;</li>
<li class=" ml-8">&#36890;&#36807;&#22312; C &#35821;&#35328;&#32534;&#31243;&#26102;&#20307;&#20250;&#32570;&#22833;&#30340;&#37096;&#20998;&#65292;&#33021;&#26356;&#22909;&#22320;&#29702;&#35299;&#29616;&#20195;&#32534;&#31243;&#35821;&#35328;&#20013;&#30340;&#26426;&#21046;&#12290;&#22914;&#26524;&#20320;&#29087;&#24713;&#29616;&#20195; C++/Rust&#65292;&#20320;&#23601;&#20250;&#23545;&#23545;&#35937;&#30340; ownership &#38750;&#24120;&#25935;&#24863;&#12290;&#21363;&#20415;&#20320;&#22312;&#20889; C&#65292;&#36825;&#31181;&#22909;&#30340;&#24605;&#32500;&#20064;&#24815;&#20381;&#28982;&#20250;&#26102;&#21051;&#20445;&#25252;&#20320;&#12290;&#22914;&#26524;&#20320;&#24819;&#24471;&#26356;&#36828;&#19968;&#20123;&#65292;&#20320;&#20381;&#28982;&#21487;&#20197;&#22312; C &#20013;&#36890;&#36807; assertions &#36817;&#20284;&#22320;&#34920;&#36798;&#20986; <a href="https://prl.ccs.neu.edu/blog/static/refinement_types_lecture.pdf" class=" text-amber-900">Refinement Types</a>&#12290;</li>
</ul>
<p class=" font-serif my-1">Golang/Rust/C++ &#37117;&#21487;&#20197;&#29992;&#26469;&#23454;&#29616;&#25805;&#20316;&#31995;&#32479;&#65292;&#19981;&#36807;&#20284;&#20046;&#29616;&#22312;&#23545;&#22823;&#23478;&#26469;&#35828;&#36127;&#25285;&#31245;&#31245;&#26377;&#20123;&#37325;&#12290;</p>
</li>
</ul>
<hr>

<ul class=" list-disc font-serif">
<li class=" ml-8">Q: <strong>&#25105;&#24819;&#36864;&#35838;/&#36461;&#35838;&#65311;</strong></li>
<li class=" ml-8">A: &#19978;&#35838;&#21487;&#20197;&#30563;&#20419;&#20320;&#20889;&#22909;&#20195;&#30721;&#12290;&#32780;<strong>&#19981;&#20889;&#20195;&#30721;&#36825;&#38376;&#35838;&#23601;&#30333;&#19978;&#20102;</strong>&#65307;&#29702;&#35299;&#36825;&#19968;&#28857;&#65292;&#27426;&#36814;&#36461;&#35838;&#12290;&#22914;&#26524;&#35273;&#24471;&#22522;&#30784;&#27809;&#26377;&#25171;&#22909;&#65292;&#23601;&#20808;&#21162;&#21147;&#23398;&#22909; C &#35821;&#35328;&#12290;&#36825;&#38376;&#35838;&#30340;&#21807;&#19968;&#35201;&#27714;&#23601;&#26159;<strong>&#20250;&#20351;&#29992; C &#35821;&#35328;&#32534;&#31243;</strong>&#65292;&#36824;&#26377;<strong>&#33021;&#35835;&#25026;&#25163;&#20876;</strong>&#12290;</li>
</ul>
<hr>

<ul class=" list-disc font-serif">
<li class=" ml-8">Q: <strong>&#25105;&#24819;&#20570;&#32431;&#29702;&#35770;&#12290;&#20195;&#30721;&#20160;&#20040;&#30340;&#20851;&#25105;&#65039;&#10006;&#65039;&#20107;&#65311;</strong></li>
<li class=" ml-8">A: &#26377;&#37027;&#20010;&#26234;&#21147;&#21644;&#22362;&#25345;&#65292;&#20889;&#28857; C &#20195;&#30721;&#30495;&#26159;&#22826;&#31616;&#21333;&#20102;&#12290;&#33457;&#19968;&#28857;&#26102;&#38388;&#21435;&#29702;&#35299;&#20889;&#20195;&#30721;&#30340;&#20851;&#38190;&#65292;&#39034;&#21033;&#23436;&#25104;&#35838;&#31243;&#19981;&#26159;&#38382;&#39064;&#65307;&#35745;&#31639;&#26426;&#31995;&#32479;/&#32534;&#31243;&#35821;&#35328;&#39046;&#22495;&#20063;&#26377;&#35768;&#22810;&#21644;&#29702;&#35770;&#20132;&#21449;&#30340;&#35838;&#39064;&#12290;</li>
</ul>
<hr>

<ul class=" list-disc font-serif">
<li class=" ml-8">Q: <strong>&#25105;&#36824;&#26159;&#22909;&#24597;&#12290;</strong></li>
<li class=" ml-8">A: Don't Panic&#12290;&#19981;&#35201;&#24908;&#65292;&#22312; Office Hours &#30340;&#26102;&#20505;&#26469;&#32842;&#19968;&#32842;&#12290;</li>
</ul></div>
</div>

<div class="container text-xs py-3">
  <span class="text-muted">
    <center><a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/"><img alt="Creative Commons License" style="border-width:0" src="../static/img/cc-4.0.png"></a>
    &#160;&#160;&#160;<a style="color:inherit" href="https://beian.miit.gov.cn/">&#33487; ICP &#22791; 2020049101 &#21495;</a>
    </center>
  </span>
</div>

</div>

<script src="../static/js/jquery.min.js"></script>

<script>
function get_token() {
  var match = document.cookie.match(new RegExp('(^| )token=([^;]+)'));
  if (match) return match[2];
  else return "";
}
var token = get_token();
var hint = "token", box = $("#token-input");

if (token == "") { }
else { box.val(token); }

function login() {
  var token = box.val()
  if (!token) {
    document.cookie = ''
  } else {
    document.cookie = 'token=' + token + '; expires=Fri, 31 Dec 9999 23:59:59 GMT;'
  }
}
</script>


</body>

</html>